
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.0   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stat
> a.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501406228912
         Licensed to:  Ben Arnold
                       University of California, Berkeley

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help
          obs_advice.
      4.  Maximum number of variables is set to 5000; see help
          set_maxvar.

. do 4-append-epi-data.do 

. capture log close

. set more off

. clear all

. 
. log using "~/dropbox/13beaches/src/dm/4-append-epi-data.log", text repl
> ace
-------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/benarnold/dropbox/13beaches/src/dm/4-append-epi-data.
> log
  log type:  text
 opened on:   7 Jan 2016, 15:41:34

. 
. *----------------------------------------
. * 4-append-epi-data.do
. * ben arnold
. *
. * append NEEAR, ADM, and Mission Bay
. * epi data into a single file
. *
. *----------------------------------------
. 
. *----------------------------------------
. * input files:
. *       neear-epi.dta
. *       adm-epi.dta
. *       mb-epi.dta
. *
. * output files:
. *       13beaches-epi.dta / .csv
. *       13beaches-epi-varlist.dta / .csv
. *----------------------------------------
. 
. 
. *----------------------------------------
. * read in NEEAR and append ADM
. *----------------------------------------
. use "~/dropbox/13beaches/data/final/neear-epi.dta", clear
(NEEAR epi data, created by 1-format-neear-epi.do)

. 
. desc, s

Contains data from ~/dropbox/13beaches/data/final/neear-epi.dta
  obs:        54,250                          NEEAR epi data, created
                                                by 1-format-neear-epi.do
 vars:           281                          7 Jan 2016 15:21
 size:    38,409,000                          
Sorted by: 

. 
. append using "~/dropbox/13beaches/data/final/adm-epi.dta"
(note: variable hhmem was byte, now int to accommodate using data's
       values)
(note: variable sex was byte, now int to accommodate using data's
       values)
(note: variable pool was byte, now int to accommodate using data's
       values)
(note: variable earplugs was byte, now int to accommodate using data's
       values)
(note: variable noseplugs was byte, now int to accommodate using data's
       values)
(note: variable mask was byte, now int to accommodate using data's
       values)
(note: variable sunmin was int, now float to accommodate using data's
       values)
(note: variable dig was byte, now int to accommodate using data's
       values)
(note: variable bsand was byte, now int to accommodate using data's
       values)
(note: variable sandwash was byte, now int to accommodate using data's
       values)
(note: variable sanddry was byte, now int to accommodate using data's
       values)
(note: variable sandmouth was byte, now int to accommodate using data's
       values)
(note: variable algae was byte, now int to accommodate using data's
       values)
(note: variable algaemouth was byte, now int to accommodate using
       data's values)
(note: variable algaewash was byte, now int to accommodate using data's
       values)
(note: variable cutbase was byte, now int to accommodate using data's
       values)
(note: variable block was byte, now int to accommodate using data's
       values)
(note: variable prothat was byte, now int to accommodate using data's
       values)
(note: variable shade was byte, now int to accommodate using data's
       values)
(note: variable repel was byte, now int to accommodate using data's
       values)
(note: variable eatfood was byte, now int to accommodate using data's
       values)
(note: variable food was byte, now int to accommodate using data's
       values)
(note: variable anim_base was byte, now int to accommodate using data's
       values)
(note: variable gicontact_base was byte, now int to accommodate using
       data's values)
(note: variable fish_base was byte, now int to accommodate using data's
       values)
(note: variable rawmeat_base was byte, now int to accommodate using
       data's values)
(note: variable eggs_base was byte, now int to accommodate using data's
       values)
(note: variable sunbase was byte, now int to accommodate using data's
       values)
(note: variable stomach was byte, now int to accommodate using data's
       values)
(note: variable stomachstill was byte, now int to accommodate using
       data's values)
(note: variable stomachdays was byte, now int to accommodate using
       data's values)
(note: variable diarrhea was byte, now int to accommodate using data's
       values)
(note: variable diarrheastill was byte, now int to accommodate using
       data's values)
(note: variable diarrheadays was byte, now int to accommodate using
       data's values)
(note: variable diarrheanumber was byte, now int to accommodate using
       data's values)
(note: variable nausea was byte, now int to accommodate using data's
       values)
(note: variable nauseastill was byte, now int to accommodate using
       data's values)
(note: variable nauseadays was byte, now int to accommodate using
       data's values)
(note: variable vomiting was byte, now int to accommodate using data's
       values)
(note: variable vomitingstill was byte, now int to accommodate using
       data's values)
(note: variable vomitingdays was byte, now int to accommodate using
       data's values)
(note: variable vomitingnumber was byte, now int to accommodate using
       data's values)
(note: variable urinarytractinfection was byte, now int to accommodate
       using data's values)
(note: variable urinarytractinfectionstill was byte, now int to
       accommodate using data's values)
(note: variable urinarytractinfectiondays was byte, now int to
       accommodate using data's values)
(note: variable fever was byte, now int to accommodate using data's
       values)
(note: variable feverstill was byte, now int to accommodate using
       data's values)
(note: variable feverdays was byte, now int to accommodate using data's
       values)
(note: variable fevertemptaken was byte, now int to accommodate using
       data's values)
(note: variable headache was byte, now int to accommodate using data's
       values)
(note: variable headachestill was byte, now int to accommodate using
       data's values)
(note: variable headachedays was byte, now int to accommodate using
       data's values)
(note: variable sorethroat was byte, now int to accommodate using
       data's values)
(note: variable sorethroatstill was byte, now int to accommodate using
       data's values)
(note: variable sorethroatdays was byte, now int to accommodate using
       data's values)
(note: variable sorethroatallergy was byte, now int to accommodate
       using data's values)
(note: variable cough was byte, now int to accommodate using data's
       values)
(note: variable coughstill was byte, now int to accommodate using
       data's values)
(note: variable coughdays was byte, now int to accommodate using data's
       values)
(note: variable coughallergy was byte, now int to accommodate using
       data's values)
(note: variable cold was byte, now int to accommodate using data's
       values)
(note: variable coldstill was byte, now int to accommodate using data's
       values)
(note: variable colddays was byte, now int to accommodate using data's
       values)
(note: variable coldallergy was byte, now int to accommodate using
       data's values)
(note: variable runnynose was byte, now int to accommodate using data's
       values)
(note: variable runnynosestill was byte, now int to accommodate using
       data's values)
(note: variable runnynosedays was byte, now int to accommodate using
       data's values)
(note: variable runnynoseallergy was byte, now int to accommodate using
       data's values)
(note: variable earache was byte, now int to accommodate using data's
       values)
(note: variable earachestill was byte, now int to accommodate using
       data's values)
(note: variable earachedays was byte, now int to accommodate using
       data's values)
(note: variable earacheallergy was byte, now int to accommodate using
       data's values)
(note: variable wateryeyes was byte, now int to accommodate using
       data's values)
(note: variable wateryeyesstill was byte, now int to accommodate using
       data's values)
(note: variable wateryeyesdays was byte, now int to accommodate using
       data's values)
(note: variable wateryeyesallergy was byte, now int to accommodate
       using data's values)
(note: variable eyeinfection was byte, now int to accommodate using
       data's values)
(note: variable eyeinfectionstill was byte, now int to accommodate
       using data's values)
(note: variable eyeinfectiondays was byte, now int to accommodate using
       data's values)
(note: variable cut was byte, now int to accommodate using data's
       values)
(note: variable cutstill was byte, now int to accommodate using data's
       values)
(note: variable cutdays was byte, now int to accommodate using data's
       values)
(note: variable rash was byte, now int to accommodate using data's
       values)
(note: variable rashstill was byte, now int to accommodate using data's
       values)
(note: variable rashdays was byte, now int to accommodate using data's
       values)
(note: variable sunburn was byte, now int to accommodate using data's
       values)
(note: variable working was byte, now int to accommodate using data's
       values)
(note: variable asth was byte, now int to accommodate using data's
       values)
(note: variable skinchron was byte, now int to accommodate using data's
       values)
(note: variable preg was byte, now int to accommodate using data's
       values)
(note: variable swam was byte, now int to accommodate using data's
       values)
(note: variable samebeach was byte, now int to accommodate using data's
       values)
(note: variable publicpool was byte, now int to accommodate using
       data's values)
(note: variable anim_int was byte, now int to accommodate using data's
       values)
(note: variable fish_int was byte, now int to accommodate using data's
       values)
(note: variable rawmeat_int was byte, now int to accommodate using
       data's values)
(note: variable eggs_int was byte, now int to accommodate using data's
       values)
(note: variable differentbeach was byte, now int to accommodate using
       data's values)
(note: variable hisp was byte, now int to accommodate using data's
       values)
(note: variable intdate was int, now float to accommodate using data's
       values)
(note: variable race was byte, now int to accommodate using data's
       values)
(note: variable stomachstdt was int, now float to accommodate using
       data's values)
(note: variable diarrheastdt was int, now float to accommodate using
       data's values)
(note: variable nauseastdt was int, now float to accommodate using
       data's values)
(note: variable vomitingstdt was int, now float to accommodate using
       data's values)
(note: variable urinarytractinfectionstdt was int, now float to
       accommodate using data's values)
(note: variable feverstdt was int, now float to accommodate using
       data's values)
(note: variable headachestdt was int, now float to accommodate using
       data's values)
(note: variable sorethroatstdt was int, now float to accommodate using
       data's values)
(note: variable coughstdt was int, now float to accommodate using
       data's values)
(note: variable coldstdt was int, now float to accommodate using data's
       values)
(note: variable runnynosestdt was int, now float to accommodate using
       data's values)
(note: variable earachestdt was int, now float to accommodate using
       data's values)
(note: variable wateryeyesstdt was int, now float to accommodate using
       data's values)
(note: variable eyeinfectionstdt was int, now float to accommodate
       using data's values)
(note: variable cutstdt was int, now float to accommodate using data's
       values)
(note: variable rashstdt was int, now float to accommodate using data's
       values)
(note: variable gibase was byte, now float to accommodate using data's
       values)
(note: variable utibase was byte, now float to accommodate using data's
       values)
(note: variable vomitbase was byte, now float to accommodate using
       data's values)
(note: variable sorebase was byte, now float to accommodate using
       data's values)
(note: variable earbase was byte, now float to accommodate using data's
       values)
(note: variable eyebase was byte, now float to accommodate using data's
       values)
(note: variable rashbase was byte, now float to accommodate using
       data's values)
(note: variable teledate was int, now float to accommodate using data's
       values)
(note: variable anim_any was byte, now float to accommodate using
       data's values)
(note: variable eggs_any was byte, now float to accommodate using
       data's values)
(note: variable fish_any was byte, now float to accommodate using
       data's values)
(note: variable rawmeat_any was byte, now float to accommodate using
       data's values)
(label yesno already defined)

. 
. desc, s

Contains data from ~/dropbox/13beaches/data/final/neear-epi.dta
  obs:        75,614                          NEEAR epi data, created
                                                by 1-format-neear-epi.do
 vars:           292                          7 Jan 2016 15:21
 size:    69,111,196                          
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. *----------------------------------------
. * append Mission Bay
. *----------------------------------------
. 
. append using "~/dropbox/13beaches/data/final/mb-epi.dta"
(note: variable beach was str2, now str10 to accommodate using data's
       values)
(note: variable beachcode was str11, now str13 to accommodate using
       data's values)
(note: variable anycontact was byte, now int to accommodate using
       data's values)
(note: variable bodycontact was byte, now int to accommodate using
       data's values)
(note: variable headunder was byte, now int to accommodate using data's
       values)
(note: variable mouthwater was byte, now int to accommodate using
       data's values)
(note: variable swallwater was byte, now int to accommodate using
       data's values)
(note: variable anyotcmeds_eye was byte, now int to accommodate using
       data's values)
(note: variable anyotcmeds_ear was byte, now int to accommodate using
       data's values)
(note: variable anyotcmeds_skn was byte, now int to accommodate using
       data's values)
(note: variable allergy was byte, now float to accommodate using data's
       values)
(note: variable gichron was byte, now float to accommodate using data's
       values)
(note: variable asth was int, now float to accommodate using data's
       values)
(note: variable anyotcmeds_gas was byte, now float to accommodate using
       data's values)
(note: variable anyotcmeds_res was byte, now float to accommodate using
       data's values)
(note: variable cough was int, now float to accommodate using data's
       values)
(note: variable differentbeach was int, now float to accommodate using
       data's values)
(note: variable earache was int, now float to accommodate using data's
       values)
(note: variable samebeach was int, now float to accommodate using
       data's values)
(note: variable shade was int, now float to accommodate using data's
       values)
(note: variable stayhomedays_ear was byte, now float to accommodate
       using data's values)
(note: variable stayhomedays_eye was byte, now float to accommodate
       using data's values)
(note: variable stayhomedays_gas was byte, now float to accommodate
       using data's values)
(note: variable stayhomedays_res was byte, now float to accommodate
       using data's values)
(note: variable stayhomedays_skn was byte, now float to accommodate
       using data's values)
(note: variable stopdailydays_ear was byte, now float to accommodate
       using data's values)
(note: variable stopdailydays_eye was byte, now float to accommodate
       using data's values)
(note: variable stopdailydays_gas was byte, now float to accommodate
       using data's values)
(note: variable stopdailydays_res was byte, now float to accommodate
       using data's values)
(note: variable stopdailydays_skn was byte, now float to accommodate
       using data's values)
(note: variable swam was int, now float to accommodate using data's
       values)
(label yesno already defined)
(label race already defined)
(label sex already defined)

. 
. desc, s

Contains data from ~/dropbox/13beaches/data/final/neear-epi.dta
  obs:        88,083                          NEEAR epi data, created
                                                by 1-format-neear-epi.do
 vars:           294                          7 Jan 2016 15:21
 size:    87,378,336                          
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. 
. * make beach labels more informative
. replace beach = "Avalon" if beach=="AV"
(6,165 real changes made)

. replace beach = "Boqueron" if beach=="BB"
(15,726 real changes made)

. replace beach = "Doheny" if beach=="DO"
(9,525 real changes made)

. replace beach = "Edgewater" if beach=="EB"
(1,351 real changes made)

. replace beach = "Fairhope" if beach=="FB"
(2,022 real changes made)

. replace beach = "Goddard" if beach=="GB"
(2,977 real changes made)

. replace beach = "Huntington" if beach=="HB"
(2,840 real changes made)

. replace beach = "Malibu" if beach=="MA"
(5,674 real changes made)

. replace beach = "Surfside" if beach=="MB"
(11,159 real changes made)

. replace beach = "Silver" if beach=="SB"
(10,921 real changes made)

. replace beach = "West" if beach=="WB"
(2,877 real changes made)

. replace beach = "Washington Park" if beach=="WP"
variable beach was str10 now str15
(4,377 real changes made)

. replace beach = "Mission Bay" if beach=="MissionBay"
(12,469 real changes made)

. 
. * format dates
. format intdate teledate %d

. 
. 
. * variable label that wasn't coming through for some reason
. label define sanddry 1 "All dry" 2 "Mostly dry" 3 "Mostly wet" 4 "All w
> et" 8 "DK" 9 "MD"

. label values sanddry sanddry

. 
. * add the Yes/No label to a few straggling variables that remain unlabe
> led
. local yesnovars "eatfood cough gicontact_int fevertemptaken working oth
> ersmiss_gas othersmiss_eye othersmiss_res othersmiss_ear othersmiss_uti
>  othersmiss_skn"

. foreach var of varlist `yesnovars' {
  2.         label values `var' yesno
  3. }

. 
. * assume that 39 people with no GI illness at enrollment are "No"
. replace gibase=0 if gibase==.
(39 real changes made)

. 
. * assume that 381 people with no information about water contact had no
> ne
. replace anycontact=0 if anycontact==.
(381 real changes made)

. * assume that 501 people with no information about body immersion conta
> ct had none
. replace bodycontact=0 if bodycontact==.
(501 real changes made)

. * assume that 550 people with no information about head immersion conta
> ct had none
. replace headunder=0 if headunder==.
(550 real changes made)

. * assume that 1648 people with no information about water ingestion had
>  none
. replace swallwater=0 if swallwater==.
(1,648 real changes made)

. 
. *---------------------------------------------
. * add variable notes
. *---------------------------------------------
. 
. * drop any existing notes
. notes drop _dta
  (4 notes dropped)

. notes drop *
  (0 notes dropped)

. 
. * general notes
. note: TS 13-Beaches Epidemiology Data, created by 4-append-epi-data.do

. note: Please contact Ben Arnold (benarnold@berkeley.edu) and Tim Wade (
> wade.tim@epa.gov) if you have specific questions about the dataset

. note: Some variables were not collected at all beaches. See 13beaches-e
> pi-varlist.dta for a summary table of variable inclusion by beach group
>  (NEEAR, Avalon/Doheny/Malibu, Mision Bay).

. note: Doheny and Malibu have a -berm- variable that indicates when a sa
> nd berm was open to allow freshwater to flow into the ocean. See Colfor
> d et al (Water Res, 2012, 46, 2176-2186) and Arnold et al (Epidemiology
> , 2013, 24, 845-853) for details. 

. note: Avalon has a -groundwater- variable that indicates that groundwat
> er flow was above median. See Yau et al (Water Res, 2014, 59, 23-36) fo
> r details.

. 
. 
. * Race variable for NEEAR
. note race: "In the NEEAR beaches, hispanic individuals were all coded a
> s non-white, which is different from Avalon/Doheney/Malibu/Mission Bay,
>  where some people identified as white, hispanic"

. 
. * sunhr for MB
. note sunhr: "sunhr and sunmin not calculable for Mission Bay -- only co
> llected as categorical data, stored as sunhr_cat"

. note sunhr_cat: "Mission Bay only collected categorical information abo
> ut exposure to direct sunlight"

. 
. * stmatch
. note stmatch: "Site- and Time-specific match code only created for Aval
> on/Doheny/Malibu beaches for merge to site- and time-specific water qua
> lity data"

. 
. * hhinc
. note hhinc: "Household income categories collected at Avalon/Doheny/Mal
> ibu"

. note hhinc_mb: "Household income categories collected at Mission Bay, d
> ifferent from Av/Do/Ma beaches"

. 
. 
. *----------------------------------------
. * save combined epidemiology dataset
. *----------------------------------------
. order beach beachcode hhid indid intdate teledate

. compress
  variable intdate was float now int
  variable teledate was float now int
  variable sex was int now byte
  variable hisp was int now byte
  variable gibase was float now byte
  variable utibase was float now byte
  variable vomitbase was float now byte
  variable sorebase was float now byte
  variable earbase was float now byte
  variable eyebase was float now byte
  variable rashbase was float now byte
  variable sunbase was int now byte
  variable gichron was float now byte
  variable asth was float now byte
  variable allergy was float now byte
  variable skinchron was int now byte
  variable sunburn was int now byte
  variable pool was int now byte
  variable dig was int now byte
  variable bsand was int now byte
  variable sandmouth was int now byte
  variable sandwash was int now byte
  variable sanddry was int now byte
  variable algae was int now byte
  variable algaemouth was int now byte
  variable cutbase was int now byte
  variable block was int now byte
  variable prothat was int now byte
  variable shade was float now byte
  variable repel was int now byte
  variable eatfood was int now byte
  variable food was int now byte
  variable anim_base was int now byte
  variable gicontact_base was int now byte
  variable fish_base was int now byte
  variable rawmeat_base was int now byte
  variable eggs_base was int now byte
  variable anycontact was int now byte
  variable bodycontact was int now byte
  variable headunder was int now byte
  variable swallwater was int now byte
  variable mouthwater was int now byte
  variable earplugs was int now byte
  variable noseplugs was int now byte
  variable mask was int now byte
  variable preg was int now byte
  variable swam was float now byte
  variable samebeach was float now byte
  variable differentbeach was float now byte
  variable publicpool was int now byte
  variable stomach was int now byte
  variable diarrhea was int now byte
  variable nausea was int now byte
  variable vomiting was int now byte
  variable urinarytractinfection was int now byte
  variable fever was int now byte
  variable headache was int now byte
  variable sorethroat was int now byte
  variable cough was float now byte
  variable cold was int now byte
  variable runnynose was int now byte
  variable earache was float now byte
  variable wateryeyes was int now byte
  variable eyeinfection was int now byte
  variable cut was int now byte
  variable rash was int now byte
  variable anim_int was int now byte
  variable fish_int was int now byte
  variable rawmeat_int was int now byte
  variable eggs_int was int now byte
  variable stomachstill was int now byte
  variable stomachdays was int now byte
  variable diarrheastill was int now byte
  variable diarrheadays was int now byte
  variable diarrheanumber was int now byte
  variable nauseastill was int now byte
  variable nauseadays was int now byte
  variable vomitingstill was int now byte
  variable vomitingdays was int now byte
  variable vomitingnumber was int now byte
  variable urinarytractinfectionstill was int now byte
  variable urinarytractinfectiondays was int now byte
  variable feverstill was int now byte
  variable feverdays was int now byte
  variable fevertemptaken was int now byte
  variable headachestill was int now byte
  variable headachedays was int now byte
  variable sorethroatstill was int now byte
  variable sorethroatdays was int now byte
  variable sorethroatallergy was int now byte
  variable coughstill was int now byte
  variable coughdays was int now byte
  variable coughallergy was int now byte
  variable coldstill was int now byte
  variable colddays was int now byte
  variable coldallergy was int now byte
  variable runnynosestill was int now byte
  variable runnynosedays was int now byte
  variable runnynoseallergy was int now byte
  variable earachestill was int now byte
  variable earachedays was int now byte
  variable earacheallergy was int now byte
  variable wateryeyesstill was int now byte
  variable wateryeyesdays was int now byte
  variable wateryeyesallergy was int now byte
  variable eyeinfectionstill was int now byte
  variable eyeinfectiondays was int now byte
  variable cutstill was int now byte
  variable cutdays was int now byte
  variable rashstill was int now byte
  variable rashdays was int now byte
  variable working was int now byte
  variable stayhomedays_gas was float now byte
  variable stopdailydays_gas was float now byte
  variable anyotcmeds_gas was float now byte
  variable stayhomedays_eye was float now byte
  variable stopdailydays_eye was float now byte
  variable anyotcmeds_eye was int now byte
  variable stayhomedays_res was float now byte
  variable stopdailydays_res was float now byte
  variable anyotcmeds_res was float now byte
  variable stayhomedays_ear was float now byte
  variable stopdailydays_ear was float now byte
  variable anyotcmeds_ear was int now byte
  variable stayhomedays_skn was float now byte
  variable stopdailydays_skn was float now byte
  variable anyotcmeds_skn was int now byte
  variable stomachstdt was float now int
  variable diarrheastdt was float now int
  variable nauseastdt was float now int
  variable vomitingstdt was float now int
  variable urinarytractinfectionstdt was float now int
  variable feverstdt was float now int
  variable headachestdt was float now int
  variable sorethroatstdt was float now int
  variable coughstdt was float now int
  variable coldstdt was float now int
  variable runnynosestdt was float now int
  variable earachestdt was float now int
  variable wateryeyesstdt was float now int
  variable eyeinfectionstdt was float now int
  variable cutstdt was float now int
  variable rashstdt was float now int
  variable rawmeat_any was float now byte
  variable fish_any was float now byte
  variable eggs_any was float now byte
  variable anim_any was float now byte
  variable hhmem was int now byte
  variable algaewash was int now byte
  variable watertime was float now int
  variable race was int now byte
  variable wetsuit was int now byte
  variable drinksy was int now byte
  variable sunburnstill was int now byte
  variable sunburndays was int now byte
  variable hhinc was int now byte
  variable sunburnstdt was float now int
  variable totdays was float now byte
  variable berm was float now byte
  variable stmatch was int now byte
  variable sunhr_cat was int now byte
  variable hhinc_mb was int now byte
  (22,020,750 bytes saved)

. label data "13 beaches epi data, created by 4-append-epi-data.do"

. saveold "~/dropbox/13beaches/data/final/13beaches-epi.dta", replace ver
> sion(12)
(saving in Stata 12 format, which can be read by Stata 11 or 12)
file ~/dropbox/13beaches/data/final/13beaches-epi.dta saved

. outsheet using "~/dropbox/13beaches/data/final/13beaches-epi.csv", comm
> a replace

. 
. * write a codebook to separate file
. log close
      name:  <unnamed>
       log:  /Users/benarnold/dropbox/13beaches/src/dm/4-append-epi-data.
> log
  log type:  text
 closed on:   7 Jan 2016, 15:41:59
-------------------------------------------------------------------------

. log using "~/dropbox/13beaches/data/final/13beaches-epi-codebook.txt", 
> text replace
-------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/benarnold/dropbox/13beaches/data/final/13beaches-epi-
> codebook.txt
  log type:  text
 opened on:   7 Jan 2016, 15:41:59

. desc, s

Contains data from ~/dropbox/13beaches/data/final/13beaches-epi.dta
  obs:        88,083                          13 beaches epi data,
                                                created by
                                                4-append-epi-data.do
 vars:           294                          7 Jan 2016 15:41
 size:    65,798,001                          
Sorted by: 

. notes

_dta:
  1.  7 Jan 2016 15:41 13-Beaches Epidemiology Data, created by
      4-append-epi-data.do
  2.  Please contact Ben Arnold (benarnold@berkeley.edu) and Tim Wade
      (wade.tim@epa.gov) if you have specific questions about the dataset
  3.  Some variables were not collected at all beaches. See
      13beaches-epi-varlist.dta for a summary table of variable inclusion
      by beach group (NEEAR, Avalon/Doheny/Malibu, Mision Bay).
  4.  Doheny and Malibu have a -berm- variable that indicates when a sand
      berm was open to allow freshwater to flow into the ocean. See
      Colford et al (Water Res, 2012, 46, 2176-2186) and Arnold et al
      (Epidemiology, 2013, 24, 845-853) for details.
  5.  Avalon has a -groundwater- variable that indicates that groundwater
      flow was above median. See Yau et al (Water Res, 2014, 59, 23-36)
      for details.

sunhr:
  1.  "sunhr and sunmin not calculable for Mission Bay -- only collected
      as categorical data, stored as sunhr_cat"

race:
  1.  "In the NEEAR beaches, hispanic individuals were all coded as
      non-white, which is different from Avalon/Doheney/Malibu/Mission
      Bay, where some people identified as white, hispanic"

hhinc:
  1.  "Household income categories collected at Avalon/Doheny/Malibu"

stmatch:
  1.  "Site- and Time-specific match code only created for
      Avalon/Doheny/Malibu beaches for merge to site- and time-specific
      water quality data"

sunhr_cat:
  1.  "Mission Bay only collected categorical information about exposure
      to direct sunlight"

hhinc_mb:
  1.  "Household income categories collected at Mission Bay, different
      from Av/Do/Ma beaches"

. codebook

-------------------------------------------------------------------------
beach                                                               Beach
-------------------------------------------------------------------------

                  type:  string (str15)

         unique values:  13                       missing "":  0/88,083

              examples:  "Boqueron"
                         "Goddard"
                         "Mission Bay"
                         "Surfside"

               warning:  variable has embedded blanks

-------------------------------------------------------------------------
beachcode                      Water quality sampling location beach code
-------------------------------------------------------------------------

                  type:  string (str13)

         unique values:  13                       missing "":  54,250/88,
> 083

              examples:  ""
                         ""
                         ""
                         "Malibu-ABDE"

               warning:  variable has embedded blanks

-------------------------------------------------------------------------
hhid                                                         Household ID
-------------------------------------------------------------------------

                  type:  string (str10)

         unique values:  38,858                   missing "":  0/88,083

              examples:  "AV272004"
                         "DO110506"
                         "HXBE51875"
                         "SB10000397"

-------------------------------------------------------------------------
indid                                                       Individual ID
-------------------------------------------------------------------------

                  type:  string (str12)

         unique values:  88,083                   missing "":  0/88,083

              examples:  "AV27200402"
                         "DO11050602"
                         "HXBE5187502"
                         "SB1000039701"

-------------------------------------------------------------------------
intdate                                                   Interview date 
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15849,18160]                units:  1
       or equivalently:  [24may2003,20sep2009]        units:  days
         unique values:  228                      missing .:  0/88,083

                  mean:     17175 = 09jan2007 (+ 0 hours)
              std. dev:   906.775

           percentiles:        10%       25%       50%       75%       90
> %
                             15912     16262     17410     18068     1810
> 4
                         26jul2003 10jul2004 01sep2007 20jun2009 26jul200
> 9

-------------------------------------------------------------------------
teledate                  Date of telephone interview (part C interview) 
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15860,18175]                units:  1
       or equivalently:  [04jun2003,05oct2009]        units:  days
         unique values:  411                      missing .:  31,171/88,0
> 83

                  mean:   17626.9 = 04apr2008 (+ 21 hours)
              std. dev:   767.293

           percentiles:        10%       25%       50%       75%       90
> %
                             15931     17691     18057     18099     1812
> 2
                         14aug2003 08jun2008 09jun2009 21jul2009 13aug200
> 9

-------------------------------------------------------------------------
sex                                              -->WHAT IS YOUR GENDER? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  sex

                 range:  [1,2]                        units:  1
         unique values:  2                        missing .:  306/88,083

            tabulation:  Freq.   Numeric  Label
                        40,573         1  Male
                        47,204         2  Female
                           306         .  

-------------------------------------------------------------------------
raceoth                             -->WHAT IS YOUR RACE? ARE YOU OTHER? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  39,637/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        36,953         0  No
                        11,493         1  Yes
                        39,637         .  

-------------------------------------------------------------------------
hisp                                                -->ARE YOU HISPANIC? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  111/88,083

            tabulation:  Freq.   Numeric  Label
                        59,328         0  No
                        28,644         1  Yes
                           111         .  

-------------------------------------------------------------------------
lat                                                          -->LATITUDE 
-------------------------------------------------------------------------

                  type:  string (str9)

         unique values:  2,268                    missing "":  60,718/88,
> 083

              examples:  ""
                         ""
                         ""
                         "N41.66661"

-------------------------------------------------------------------------
longi                                                       -->LONGITUDE 
-------------------------------------------------------------------------

                  type:  string (str10)

         unique values:  2,178                    missing "":  60,718/88,
> 083

              examples:  ""
                         ""
                         ""
                         "W071.43285"

-------------------------------------------------------------------------
gibase                                             gi symptom (baseline) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/88,083

            tabulation:  Freq.   Numeric  Label
                        86,058         0  No
                         2,025         1  Yes

-------------------------------------------------------------------------
utibase                                                   uti (baseline) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  12,509/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        75,182         0  No
                           392         1  Yes
                        12,509         .  

-------------------------------------------------------------------------
vomitbase                                            vomiting (baseline) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  12,502/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        74,851         0  No
                           730         1  Yes
                        12,502         .  

-------------------------------------------------------------------------
sorebase                                          sore throat (baseline) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  435/88,083

            tabulation:  Freq.   Numeric  Label
                        82,667         0  No
                         4,981         1  Yes
                           435         .  

-------------------------------------------------------------------------
earbase                                               earache (baseline) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  12,506/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        74,574         0  No
                         1,003         1  Yes
                        12,506         .  

-------------------------------------------------------------------------
eyebase                                             eye sympt (baseline) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  434/88,083

            tabulation:  Freq.   Numeric  Label
                        87,122         0  No
                           527         1  Yes
                           434         .  

-------------------------------------------------------------------------
rashbase                                                 rash (baseline) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  429/88,083

            tabulation:  Freq.   Numeric  Label
                        85,497         0  No
                         2,157         1  Yes
                           429         .  

-------------------------------------------------------------------------
sunbase                                               sunburn (baseline) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno, but 1 nonmissing value is not labeled

                 range:  [0,2]                        units:  1
         unique values:  3                        missing .:  12,612/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        51,696         0  No
                         4,608         1  Yes
                        19,167         2  
                        12,612         .  

-------------------------------------------------------------------------
gichron                                                  chronic gi prob 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  40/88,083

            tabulation:  Freq.   Numeric  Label
                        85,563         0  No
                         2,480         1  Yes
                            40         .  

-------------------------------------------------------------------------
asth                                                   chronic resp prob 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  22,218/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        60,055         0  No
                         5,810         1  Yes
                        22,218         .  

-------------------------------------------------------------------------
allergy                                                        allergies 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  3,761/88,08
> 3

            tabulation:  Freq.   Numeric  Label
                        71,892         0  No
                        12,430         1  Yes
                         3,761         .  

-------------------------------------------------------------------------
skinchron                                              chronic skin prob 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  21,832/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        61,880         0  No
                         4,371         1  Yes
                        21,832         .  

-------------------------------------------------------------------------
come   -->HOME MANY TIMES DO YOU USUALLY COME TO THIS BEACH EACH SUMMER? 
-------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [0,997]                      units:  1
         unique values:  78                       missing .:  12,559/88,0
> 83

                  mean:   7.11853
              std. dev:   15.4427

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         3         7        1
> 5

-------------------------------------------------------------------------
miles               -->HOW MANY MILES DID YOU TRAVEL TO THE BEACH TODAY? 
-------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [0,9000]                     units:  1
         unique values:  308                      missing .:  35,227/88,0
> 83

                  mean:   49.7261
              std. dev:   118.966

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         3        20        55       11
> 2

-------------------------------------------------------------------------
sunburn         -->Have you had a sunburn since the interview? (Derived) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  27,325/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        48,990         0  No
                        11,768         1  Yes
                        27,325         .  

-------------------------------------------------------------------------
age                                                         age in years 
-------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [0,109]                      units:  1
         unique values:  102                      missing .:  1,219/88,08
> 3

                  mean:   28.9611
              std. dev:   18.3255

           percentiles:        10%       25%       50%       75%       90
> %
                                 5        12        28        43        5
> 3

-------------------------------------------------------------------------
areamst   -->WHAT PART OF THE BEACH DID [YOU/(HE/SHE)] SWIM IN THE MOST? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,9]                        units:  1
         unique values:  8                        missing .:  51,910/88,0
> 83

            tabulation:  Freq.  Value
                         6,848  1
                         8,868  2
                         8,463  3
                         7,580  4
                         4,225  5
                             1  7
                             1  8
                           187  9
                        51,910  .

-------------------------------------------------------------------------
pool                                   -->DID [YOU/(HE/SHE)] HAVE CONTACT
                                       WITH WATER IN A NON-CURCULATING
                                       POOL OR TIDAL
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  44,308/88,0
> 83

            tabulation:  Freq.  Value
                        42,201  0
                         1,574  1
                        44,308  .

-------------------------------------------------------------------------
sunmin                                 -->WHAT WOULD YOU ESTIMATE
                                       [YOUR/(HIS/HER)] TOTAL TIME IN
                                       DIRECT SUNLIGHT WAS?
-------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,810]                      units:  1.000e-09
         unique values:  198                      missing .:  12,965/88,0
> 83

                  mean:   112.802
              std. dev:   104.521

           percentiles:        10%       25%       50%       75%       90
> %
                           .033333   .083333       120       180       24
> 0

-------------------------------------------------------------------------
sunhr                                  -->WHAT WOULD YOU ESTIMATE
                                       [YOUR/(HIS/HER)] TOTAL TIME IN
                                       DIRECT SUNLIGHT WAS?
-------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,15]                       units:  1.000e-09
         unique values:  280                      missing .:  12,965/88,0
> 83

                  mean:   2.75894
              std. dev:    1.7019

           percentiles:        10%       25%       50%       75%       90
> %
                                 1       1.5       2.5         4         
> 5

-------------------------------------------------------------------------
dig                                                          dug in sand 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  651/88,083

            tabulation:  Freq.   Numeric  Label
                        56,085         0  No
                        31,347         1  Yes
                           651         .  

-------------------------------------------------------------------------
bsand                                                body buried in sand 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  13,665/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        68,924         0  No
                         5,494         1  Yes
                        13,665         .  

-------------------------------------------------------------------------
sandmouth                              -->DID [YOU/(HE/SHE)] GET ANY SAND
                                       IN [YOUR/(HIS/HER)] MOUTH?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  35,668/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        46,963         0  No
                         5,452         1  Yes
                        35,668         .  

-------------------------------------------------------------------------
seatdr                                 -->AFTER PLAYING IN THE SAND, DID
                                       [YOU/(HE/SHE)] EAT OR DRINK
                                       ANYWHERE?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  78,931/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         3,691         0  No
                         5,461         1  Yes
                        78,931         .  

-------------------------------------------------------------------------
sandwash                               -->AFTER PLAYING IN THE SAND, DID
                                       [YOU/(HE/SHE)] WASH
                                       [YOUR/(HIS/HER)] HANDS BEF
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  74,538/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         8,208         0  No
                         5,337         1  Yes
                        74,538         .  

-------------------------------------------------------------------------
sanddry   -->WAS THE SAND [YOU/(HE/SHE)] DUG IN OR PLAYED IN WET OR DRY? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  sanddry

                 range:  [1,4]                        units:  1
         unique values:  4                        missing .:  70,788/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         2,236         1  All dry
                         6,293         2  Mostly dry
                         6,183         3  Mostly wet
                         2,583         4  All wet
                        70,788         .  

-------------------------------------------------------------------------
algae                                          played with algae/seaweed 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  842/88,083

            tabulation:  Freq.   Numeric  Label
                        79,280         0  No
                         7,961         1  Yes
                           842         .  

-------------------------------------------------------------------------
algaemouth                             -->DID [YOU/(HE/SHE)] GET ANY
                                       SEAWEED IN [YOUR/(HIS/HER)] MOUTH?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  52,701/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        35,022         0  No
                           360         1  Yes
                        52,701         .  

-------------------------------------------------------------------------
cutbase                                                   Cut (baseline) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  729/88,083

            tabulation:  Freq.   Numeric  Label
                        81,172         0  No
                         6,182         1  Yes
                           729         .  

-------------------------------------------------------------------------
block               -->DID [YOU/(HE/SHE)] WEAR SUNSCREEN/SUNBLOCK TODAY? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  634/88,083

            tabulation:  Freq.   Numeric  Label
                        29,781         0  No
                        57,668         1  Yes
                           634         .  

-------------------------------------------------------------------------
spf                                    -->WHAT WAS THE SPF RATING OF THE
                                       SUNSCREEN/SUNBLOCK [YOU/(HE/SHE)]
                                       USED MOST OF
-------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,702]                      units:  1
         unique values:  65                       missing .:  56,944/88,0
> 83

                  mean:   37.7474
              std. dev:   18.5174

           percentiles:        10%       25%       50%       75%       90
> %
                                15        30        30        50        6
> 0

-------------------------------------------------------------------------
blockface                              -->WHEN [YOU/(HE/SHE)] USED
                                       SUNSCREEN/SUNBLOCK TODAY, HOW DID
                                       [YOU/(HE/SHE)] APP
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  64,880/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        16,733         0  No
                         6,470         1  Yes
                        64,880         .  

-------------------------------------------------------------------------
reapp                       -->DID [YOU/(HE/SHE)] REAPPLY AT LEAST ONCE? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  56,262/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        15,779         0  No
                        16,042         1  Yes
                        56,262         .  

-------------------------------------------------------------------------
prothat                                -->DID [YOU/(HE/SHE)] WEAR A HAT
                                       OR OTHER PROTECTIVE CLOTHING
                                       TODAY?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  21,560/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        47,770         0  No
                        18,753         1  Yes
                        21,560         .  

-------------------------------------------------------------------------
protbrim                               -->DID THE HAT HAVE A WIDE BRIM OR
                                       ANOTHER WAY TO SHADE
                                       [YOUR/(HIS/HER)] FACE, E
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  79,528/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         5,072         0  No
                         3,483         1  Yes
                        79,528         .  

-------------------------------------------------------------------------
shade                                  -->DID [YOU/(HE/SHE)] USE
                                       PROTECTIVE EQUIPMENT SUCH AS A
                                       CANOPY, UMBRELLA OR OTH
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  678/88,083

            tabulation:  Freq.   Numeric  Label
                        63,455         0  No
                        23,950         1  Yes
                           678         .  

-------------------------------------------------------------------------
protslv                                -->DID [YOU/(HE/SHE)] WEAR
                                       PROTECTIVE CLOTHING, SUCH AS A
                                       LONG-SLEEVED SHIRT OR
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  55,037/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        29,796         0  No
                         3,250         1  Yes
                        55,037         .  

-------------------------------------------------------------------------
tanning                                What happens when in sun
                                       repeatedly without sunscreen
                                       during the summer?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  tanning

                 range:  [1,6]                        units:  1
         unique values:  6                        missing .:  55,052/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         9,297         1  Dark Tan
                        14,093         2  Some Tanning
                         1,534         3  No Tan, Some Freckles
                         6,286         4  Repeated Sunburns
                           792         5  Other (specify)
                         1,029         6  Never Go Out in the Sun
                        55,052         .  

-------------------------------------------------------------------------
repel                 -->DID [YOU/(HE/SHE)] WEAR INSECT REPELLANT TODAY? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  609/88,083

            tabulation:  Freq.   Numeric  Label
                        81,950         0  No
                         5,524         1  Yes
                           609         .  

-------------------------------------------------------------------------
eatfood      -->DID [YOU/(HE/SHE)] CONSUME FOOD WHILE AT THE BEACH TODAY 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  692/88,083

            tabulation:  Freq.   Numeric  Label
                        29,366         0  No
                        58,025         1  Yes
                           692         .  

-------------------------------------------------------------------------
food                                  -->WAS THE FOOD BROUGHT FROM HOME? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  12,092/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        28,827         0  No
                        47,164         1  Yes
                        12,092         .  

-------------------------------------------------------------------------
anim_base                                  any animal contact (baseline) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  731/88,083

            tabulation:  Freq.   Numeric  Label
                        56,448         0  No
                        30,904         1  Yes
                           731         .  

-------------------------------------------------------------------------
gicontact_base                         contact person with gi (baseline) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  883/88,083

            tabulation:  Freq.   Numeric  Label
                        82,929         0  No
                         4,271         1  Yes
                           883         .  

-------------------------------------------------------------------------
fish_base                                    Consume raw fish (baseline) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  601/88,083

            tabulation:  Freq.   Numeric  Label
                        85,162         0  No
                         2,320         1  Yes
                           601         .  

-------------------------------------------------------------------------
rawmeat_base                                 Consume raw meat (baseline) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  621/88,083

            tabulation:  Freq.   Numeric  Label
                        81,340         0  No
                         6,122         1  Yes
                           621         .  

-------------------------------------------------------------------------
eggs_base                                    Consume raw eggs (baseline) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  627/88,083

            tabulation:  Freq.   Numeric  Label
                        84,157         0  No
                         3,299         1  Yes
                           627         .  

-------------------------------------------------------------------------
anycontact                                        Any contact with water 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/88,083

            tabulation:  Freq.   Numeric  Label
                        27,460         0  No
                        60,623         1  Yes

-------------------------------------------------------------------------
bodycontact                                      Body contact with water 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/88,083

            tabulation:  Freq.   Numeric  Label
                        39,510         0  No
                        48,573         1  Yes

-------------------------------------------------------------------------
headunder                                               Head under water 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/88,083

            tabulation:  Freq.   Numeric  Label
                        50,084         0  No
                        37,999         1  Yes

-------------------------------------------------------------------------
swallwater                                               Swallowed water 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/88,083

            tabulation:  Freq.   Numeric  Label
                        76,875         0  No
                        11,208         1  Yes

-------------------------------------------------------------------------
mouthwater                                                Water in mouth 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  1,208/88,08
> 3

            tabulation:  Freq.   Numeric  Label
                        61,676         0  No
                        25,199         1  Yes
                         1,208         .  

-------------------------------------------------------------------------
wave                                     Body surf/boog board/snork/raft 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  298/88,083

            tabulation:  Freq.   Numeric  Label
                        81,317         0  No
                         6,468         1  Yes
                           298         .  

-------------------------------------------------------------------------
earplugs                                                  Wear ear plugs 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  13,394/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        73,855         0  No
                           834         1  Yes
                        13,394         .  

-------------------------------------------------------------------------
noseplugs                                                Wear nose plugs 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  13,357/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        74,488         0  No
                           238         1  Yes
                        13,357         .  

-------------------------------------------------------------------------
mask                                                Wear mask or goggles 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  13,388/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        69,068         0  No
                         5,627         1  Yes
                        13,388         .  

-------------------------------------------------------------------------
preg                                   -->Between your beach visit and
                                       today, were you menstruating or
                                       pregnant?
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  60,111/88,0
> 83

            tabulation:  Freq.  Value
                        24,322  0
                         3,650  1
                        60,111  .

-------------------------------------------------------------------------
swam                                   -->Have you went bathing or
                                       swimming anywhere since the beach
                                       interview? (Derive
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  8,337/88,08
> 3

            tabulation:  Freq.   Numeric  Label
                        38,523         0  No
                        41,223         1  Yes
                         8,337         .  

-------------------------------------------------------------------------
samebeach                              -->Did you go bathing or swimming
                                       at the same beach since the beach
                                       interview?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  10,581/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        65,083         0  No
                        12,419         1  Yes
                        10,581         .  

-------------------------------------------------------------------------
differentbeach     -->Did you go bathing or swimming at any other beach? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  10,571/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        66,650         0  No
                        10,862         1  Yes
                        10,571         .  

-------------------------------------------------------------------------
beachtype                                          -->What ype of beach? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  beachtype

                 range:  [1,6]                        units:  1
         unique values:  4                        missing .:  82,527/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         1,829         1  Lake
                           209         2  River
                         3,332         3  Ocean
                           186         6  Other
                        82,527         .  

-------------------------------------------------------------------------
publicpool           -->Did you go bathing or swimming at a public pool? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  14,278/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        63,008         0  No
                        10,797         1  Yes
                        14,278         .  

-------------------------------------------------------------------------
stomach                                -->Have you had a stomachache or
                                       abdominal cramping since the
                                       interview? (Derive
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  31,413/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        52,331         0  No
                         4,339         1  Yes
                        31,413         .  

-------------------------------------------------------------------------
diarrhea                               -->Have you had diarrhea or loose
                                       bowels since the interview?
                                       (Derived)
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  22,687/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        61,483         0  No
                         3,913         1  Yes
                        22,687         .  

-------------------------------------------------------------------------
nausea             -->Have you had nausea since the interview? (Derived) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  23,933/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        61,729         0  No
                         2,421         1  Yes
                        23,933         .  

-------------------------------------------------------------------------
vomiting                               -->Have you had throwing up or
                                       vomiting since the interview?
                                       (Derived)
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  24,309/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        62,501         0  No
                         1,273         1  Yes
                        24,309         .  

-------------------------------------------------------------------------
urinarytractinfection                  -->Have you had a urinary tract
                                       infection or burning sensation
                                       when urinating si
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  33,632/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        53,848         0  No
                           603         1  Yes
                        33,632         .  

-------------------------------------------------------------------------
fever             -->Have you had a fever since the interview? (Derived) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  23,938/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        62,063         0  No
                         2,082         1  Yes
                        23,938         .  

-------------------------------------------------------------------------
headache                               -->Have you had a headache lasting
                                       more than a few hours since the
                                       interview? (D
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  31,443/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        51,733         0  No
                         4,907         1  Yes
                        31,443         .  

-------------------------------------------------------------------------
sorethroat                             -->Have you had a sore throat
                                       since the interview? (Derived)
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  22,952/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        60,472         0  No
                         4,659         1  Yes
                        22,952         .  

-------------------------------------------------------------------------
cough         -->Have you had a bad cough since the interview? (Derived) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  23,863/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        61,543         0  No
                         2,677         1  Yes
                        23,863         .  

-------------------------------------------------------------------------
cold               -->Have you had a cold since the interview? (Derived) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  32,209/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        52,443         0  No
                         3,431         1  Yes
                        32,209         .  

-------------------------------------------------------------------------
runnynose                              -->Have you had a runny or stuffy
                                       nose since the interview?
                                       (Derived)
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  22,053/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        58,649         0  No
                         7,381         1  Yes
                        22,053         .  

-------------------------------------------------------------------------
earache                                -->Have you had an earache, ear
                                       infection, or runny ears since the
                                       interview? (D
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  24,168/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        62,277         0  No
                         1,638         1  Yes
                        24,168         .  

-------------------------------------------------------------------------
wateryeyes    -->Have you had watery eyes since the interview? (Derived) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  33,138/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        53,101         0  No
                         1,844         1  Yes
                        33,138         .  

-------------------------------------------------------------------------
eyeinfection                           -->Have you had an eye infection
                                       since the interview? (Derived)
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  24,979/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        62,297         0  No
                           807         1  Yes
                        24,979         .  

-------------------------------------------------------------------------
cut       -->Have you had an infected cut since the interview? (Derived) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  24,878/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        62,842         0  No
                           363         1  Yes
                        24,878         .  

-------------------------------------------------------------------------
rash                                   -->Have you had a rash or itchy
                                       skin since the interview?
                                       (Derived)
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  23,458/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        61,549         0  No
                         3,076         1  Yes
                        23,458         .  

-------------------------------------------------------------------------
anim_int                                      Animal contact (interview) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  22,538/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        29,762         0  No
                        35,783         1  Yes
                        22,538         .  

-------------------------------------------------------------------------
gicontact_int                         contact person with gi (interview) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  34,127/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        51,557         0  No
                         2,399         1  Yes
                        34,127         .  

-------------------------------------------------------------------------
fish_int                                    Consume raw fish (interview) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  23,945/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        60,718         0  No
                         3,420         1  Yes
                        23,945         .  

-------------------------------------------------------------------------
rawmeat_int                                 Consume raw meat (interview) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  20,599/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        59,927         0  No
                         7,557         1  Yes
                        20,599         .  

-------------------------------------------------------------------------
eggs_int                                    Consume raw eggs (interview) 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  23,910/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        61,566         0  No
                         2,607         1  Yes
                        23,910         .  

-------------------------------------------------------------------------
stomachstill   -->Do you still have a stomachache or abdominal cramping? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  38,182/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        49,234         0  No
                           667         1  Yes
                        38,182         .  

-------------------------------------------------------------------------
stomachdays                            -->For how many days did your
                                       stomachache or abdominal cramping
                                       last?
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,17]                       units:  1
         unique values:  18                       missing .:  83,807/88,0
> 83

                  mean:   2.56665
              std. dev:   2.47344

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         2         3         
> 6

-------------------------------------------------------------------------
diarrheastill                             -->Do you still have diarrhea? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  38,219/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        49,415         0  No
                           449         1  Yes
                        38,219         .  

-------------------------------------------------------------------------
diarrheadays                -->For how many days did your diarrhea last? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,16]                       units:  1
         unique values:  16                       missing .:  84,589/88,0
> 83

                  mean:   2.44991
              std. dev:   2.29344

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         2         3         
> 5

-------------------------------------------------------------------------
diarrheanumber                         -->What was the maximum number of
                                       bouts or episodes of diarrhea you
                                       experienced
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,40]                       units:  1
         unique values:  22                       missing .:  84,740/88,0
> 83

                  mean:    4.1388
              std. dev:   2.60251

           percentiles:        10%       25%       50%       75%       90
> %
                                 2         3         4         5         
> 7

-------------------------------------------------------------------------
nauseastill                                 -->Do you still have nausea? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  38,979/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        48,763         0  No
                           341         1  Yes
                        38,979         .  

-------------------------------------------------------------------------
nauseadays                    -->For how many days did your nausea last? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,16]                       units:  1
         unique values:  16                       missing .:  85,916/88,0
> 83

                  mean:   2.49146
              std. dev:   2.41758

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         2         3         
> 5

-------------------------------------------------------------------------
vomitingstill                                 -->Are you still vomiting? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  39,247/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        48,791         0  No
                            45         1  Yes
                        39,247         .  

-------------------------------------------------------------------------
vomitingdays                -->For how many days did your vomiting last? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,13]                       units:  1
         unique values:  14                       missing .:  87,004/88,0
> 83

                  mean:   1.62465
              std. dev:   1.55511

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         1         2         
> 3

-------------------------------------------------------------------------
vomitingnumber                         -->What was the maximum number of
                                       times that you vomited during a
                                       24-hour period
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,30]                       units:  1
         unique values:  19                       missing .:  87,007/88,0
> 83

                  mean:    3.2658
              std. dev:   3.10408

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         2         4         
> 6

-------------------------------------------------------------------------
urinarytractinfectionstill             -->Do you still have a urinary
                                       tract infection or burning
                                       sensation?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  39,577/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        48,276         0  No
                           230         1  Yes
                        39,577         .  

-------------------------------------------------------------------------
urinarytractinfectiondays              -->For how many days did your
                                       urinary tract infection or burning
                                       sensation last?
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,14]                       units:  1
         unique values:  14                       missing .:  87,494/88,0
> 83

                  mean:   4.37861
              std. dev:   2.95043

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         2         3         6         
> 9

-------------------------------------------------------------------------
feverstill                                 -->Do you still have a fever? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  39,154/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        48,684         0  No
                           245         1  Yes
                        39,154         .  

-------------------------------------------------------------------------
feverdays                      -->For how many days did your fever last? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,13]                       units:  1
         unique values:  14                       missing .:  86,330/88,0
> 83

                  mean:   2.37707
              std. dev:    1.8119

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         2         3         
> 4

-------------------------------------------------------------------------
fevertemptaken        -->Was your temperature taken using a thermometer? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  39,885/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        47,553         0  No
                           645         1  Yes
                        39,885         .  

-------------------------------------------------------------------------
fevertemp                              -->What is the highest temperature
                                       that you have had since the
                                       interview?
-------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [98.6,99999]                 units:  .1
         unique values:  75                       missing .:  87,451/88,0
> 83

                  mean:    855.92
              std. dev:      7978

           percentiles:        10%       25%       50%       75%       90
> %
                              99.8     100.2       101       102     103.
> 5

-------------------------------------------------------------------------
headachestill                           -->Do you still have a headache? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  38,289/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        48,982         0  No
                           812         1  Yes
                        38,289         .  

-------------------------------------------------------------------------
headachedays                -->For how many days did your headache last? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,98]                       units:  1
         unique values:  16                       missing .:  83,450/88,0
> 83

                  mean:   2.38183
              std. dev:   2.70201

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         2         3         
> 5

-------------------------------------------------------------------------
sorethroatstill                      -->Do you still have a sore throat? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  38,337/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        48,392         0  No
                         1,354         1  Yes
                        38,337         .  

-------------------------------------------------------------------------
sorethroatdays           -->For how many days did your sore throat last? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,16]                       units:  1
         unique values:  16                       missing .:  83,893/88,0
> 83

                  mean:   3.54344
              std. dev:   2.53661

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         2         3         4         
> 7

-------------------------------------------------------------------------
sorethroatallergy          -->Was this sore throat related to allergies? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  38,732/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        48,599         0  No
                           752         1  Yes
                        38,732         .  

-------------------------------------------------------------------------
coughstill                             -->Do you still have a bad cough? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  39,015/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        47,842         0  No
                         1,226         1  Yes
                        39,015         .  

-------------------------------------------------------------------------
coughdays                      -->For how many days did your cough last? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,16]                       units:  1
         unique values:  17                       missing .:  85,883/88,0
> 83

                  mean:   5.24182
              std. dev:   3.03544

           percentiles:        10%       25%       50%       75%       90
> %
                                 2         3         4         7        1
> 0

-------------------------------------------------------------------------
coughallergy                 -->Was this bad cough related to allergies? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  39,192/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        48,494         0  No
                           397         1  Yes
                        39,192         .  

-------------------------------------------------------------------------
coldstill                                   -->Do you still have a cold? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  38,632/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        47,607         0  No
                         1,844         1  Yes
                        38,632         .  

-------------------------------------------------------------------------
colddays                        -->For how many days did your cold last? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,16]                       units:  1
         unique values:  17                       missing .:  84,690/88,0
> 83

                  mean:   4.85912
              std. dev:   2.72364

           percentiles:        10%       25%       50%       75%       90
> %
                                 2         3         4         7         
> 9

-------------------------------------------------------------------------
coldallergy                       -->Was this cold related to allergies? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  38,859/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        48,591         0  No
                           633         1  Yes
                        38,859         .  

-------------------------------------------------------------------------
runnynosestill              -->Do you still have a runny or stuffy nose? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  37,685/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        47,240         0  No
                         3,158         1  Yes
                        37,685         .  

-------------------------------------------------------------------------
runnynosedays   -->For how many days did your runny or stuffy nose last? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,17]                       units:  1
         unique values:  18                       missing .:  81,416/88,0
> 83

                  mean:   4.43948
              std. dev:   3.08511

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         2         3         6        1
> 0

-------------------------------------------------------------------------
runnynoseallergy                       -->Was this runny or stuffy nose
                                       related to allergies?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  38,213/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        47,019         0  No
                         2,851         1  Yes
                        38,213         .  

-------------------------------------------------------------------------
earachestill                           -->Do you still have an earache,
                                       ear infection or runny ears?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  39,271/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        48,304         0  No
                           508         1  Yes
                        39,271         .  

-------------------------------------------------------------------------
earachedays                            -->For how many days did your
                                       earache, ear infection or runny
                                       ears last?
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,17]                       units:  1
         unique values:  18                       missing .:  86,692/88,0
> 83

                  mean:   4.13587
              std. dev:   3.11521

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         2         3         6         
> 9

-------------------------------------------------------------------------
earacheallergy                         -->Was this earache, ear infection
                                       or runny ears related to
                                       allergies?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  39,370/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        48,562         0  No
                           151         1  Yes
                        39,370         .  

-------------------------------------------------------------------------
wateryeyesstill                        -->Do you still have watery eyes? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  39,193/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        48,286         0  No
                           604         1  Yes
                        39,193         .  

-------------------------------------------------------------------------
wateryeyesdays           -->For how many days did your watery eyes last? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,14]                       units:  1
         unique values:  15                       missing .:  86,415/88,0
> 83

                  mean:   3.61691
              std. dev:    3.0258

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         2         5         
> 9

-------------------------------------------------------------------------
wateryeyesallergy          -->Were the watery eyes related to allergies? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  39,339/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        47,925         0  No
                           819         1  Yes
                        39,339         .  

-------------------------------------------------------------------------
eyeinfectionstill                -->Do you still have the eye infection? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  39,616/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        48,303         0  No
                           164         1  Yes
                        39,616         .  

-------------------------------------------------------------------------
eyeinfectiondays       -->For how many days did your eye infection last? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,15]                       units:  1
         unique values:  14                       missing .:  87,695/88,0
> 83

                  mean:   4.41237
              std. dev:     2.889

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         2         4         6         
> 9

-------------------------------------------------------------------------
cutstill                           -->Do you still have an infected cut? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  39,565/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        48,386         0  No
                           132         1  Yes
                        39,565         .  

-------------------------------------------------------------------------
cutdays                 -->For how many days did your infected cut last? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,14]                       units:  1
         unique values:  13                       missing .:  87,819/88,0
> 83

                  mean:   4.47727
              std. dev:   2.62038

           percentiles:        10%       25%       50%       75%       90
> %
                                 2         2         4         6         
> 8

-------------------------------------------------------------------------
rashstill                   -->Do you still have the rash or itchy skin? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  38,868/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        47,977         0  No
                         1,238         1  Yes
                        38,868         .  

-------------------------------------------------------------------------
rashdays          -->For how many days did your rash or itchy skin last? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,16]                       units:  1
         unique values:  17                       missing .:  85,328/88,0
> 83

                  mean:   5.13394
              std. dev:   3.53279

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         2         4         8        1
> 1

-------------------------------------------------------------------------
working                                -->When your symptoms began, were
                                       you working for pay either inside
                                       or outside t
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  65,187/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        10,922         0  No
                        11,974         1  Yes
                        65,187         .  

-------------------------------------------------------------------------
stayhome_gas    -->During your illness, did you miss any time from work? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  85,943/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         1,661         0  No
                           479         1  Yes
                        85,943         .  

-------------------------------------------------------------------------
stayhomedays_gas                                       -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,14]                       units:  1
         unique values:  9                        missing .:  87,606/88,0
> 83

            tabulation:  Freq.  Value
                            44  0
                           273  1
                            90  2
                            41  3
                            11  4
                            10  5
                             6  7
                             1  10
                             1  14
                        87,606  .

-------------------------------------------------------------------------
stopdaily_gas                          -->Did this illness prevent you
                                       from performing daily activities
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  81,831/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         3,778         0  No
                         2,474         1  Yes
                        81,831         .  

-------------------------------------------------------------------------
stopdailydays_gas                                      -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,98]                       units:  1
         unique values:  15                       missing .:  85,621/88,0
> 83

                  mean:   2.05849
              std. dev:   2.54193

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         2         2         
> 4

-------------------------------------------------------------------------
othersmiss_gas                         -->Did your illness cause other
                                       household members to lose time at
                                       work?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  83,145/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         4,693         0  No
                           245         1  Yes
                        83,145         .  

-------------------------------------------------------------------------
othersmissdays_gas                                     -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,10]                       units:  1
         unique values:  9                        missing .:  87,840/88,0
> 83

            tabulation:  Freq.  Value
                             9  0
                           139  1
                            46  2
                            26  3
                             9  4
                             5  5
                             1  6
                             5  7
                             3  10
                        87,840  .

-------------------------------------------------------------------------
phonedoc_gas                           -->Did you consult a healthcare
                                       provider over the phone about this
                                       illness?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  83,081/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         4,592         0  No
                           410         1  Yes
                        83,081         .  

-------------------------------------------------------------------------
visitdoc_gas                    -->Did you visit a health care provider? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82,339/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         5,056         0  No
                           688         1  Yes
                        82,339         .  

-------------------------------------------------------------------------
visitdoctimes_gas                                     -->How many times? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,10]                       units:  1
         unique values:  7                        missing .:  87,493/88,0
> 83

            tabulation:  Freq.  Value
                             4  0
                           474  1
                            88  2
                            18  3
                             1  4
                             3  5
                             2  10
                        87,493  .

-------------------------------------------------------------------------
diagnosis_gas                          -->What illness did the health
                                       care provider say you had?
-------------------------------------------------------------------------

                  type:  string (str50)

         unique values:  314                      missing "":  39,523/88,
> 083

              examples:  ""
                         ""
                         "."
                         ".                                          "

               warning:  variable has embedded and trailing blanks

-------------------------------------------------------------------------
emergencyroom_gas                    -->Did you visit an emergency room? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  83,199/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         4,715         0  No
                           169         1  Yes
                        83,199         .  

-------------------------------------------------------------------------
visitertimes_gas                                      -->How many times? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,4]                        units:  1
         unique values:  4                        missing .:  87,914/88,0
> 83

            tabulation:  Freq.  Value
                           145  1
                            21  2
                             2  3
                             1  4
                        87,914  .

-------------------------------------------------------------------------
hospitalized_gas                   -->Were you admitted to the hospital? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  88,062/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                            17         0  No
                             4         1  Yes
                        88,062         .  

-------------------------------------------------------------------------
hospitaldays_gas                 -->How many days were you hospitalized? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,8]                        units:  1
         unique values:  8                        missing .:  88,050/88,0
> 83

            tabulation:  Freq.  Value
                             1  0
                            20  1
                             2  2
                             5  3
                             2  4
                             1  5
                             1  6
                             1  8
                        88,050  .

-------------------------------------------------------------------------
anyprescrdrug_gas                      -->Did you receive a prescription
                                       for an antibiotic or other drug
                                       for this illne
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  83,170/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         4,454         0  No
                           459         1  Yes
                        83,170         .  

-------------------------------------------------------------------------
ownmoneyfordrugs_gas                   -->About how much of your own or
                                       your household's money was spent
                                       altogether for
-------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [0,999999]                   units:  1
         unique values:  69                       missing .:  87,457/88,0
> 83

                  mean:    306808
              std. dev:    461431

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         5      27.5    999999    99999
> 9

-------------------------------------------------------------------------
anyotcmeds_gas                         -->Did you use any
                                       over-the-counter medications,
                                       including things like special d
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  81,759/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         3,476         0  No
                         2,848         1  Yes
                        81,759         .  

-------------------------------------------------------------------------
ownmoneyforotc_gas                     -->About how much of your own or
                                       your household's money was spent
                                       altogether for
-------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [0,999999]                   units:  1
         unique values:  56                       missing .:  85,373/88,0
> 83

                  mean:   75662.4
              std. dev:    264474

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         4        10        3
> 5

-------------------------------------------------------------------------
stayhome_eye    -->During your illness, did you miss any time from work? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  87,229/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                           733         0  No
                           121         1  Yes
                        87,229         .  

-------------------------------------------------------------------------
stayhomedays_eye                                       -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,10]                       units:  1
         unique values:  8                        missing .:  87,962/88,0
> 83

            tabulation:  Freq.  Value
                            10  0
                            62  1
                            19  2
                            13  3
                             5  4
                            10  5
                             1  7
                             1  10
                        87,962  .

-------------------------------------------------------------------------
stopdaily_eye                          -->Did this illness prevent you
                                       from performing daily activities
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  85,956/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         1,708         0  No
                           419         1  Yes
                        85,956         .  

-------------------------------------------------------------------------
stopdailydays_eye                                      -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,15]                       units:  1
         unique values:  12                       missing .:  87,713/88,0
> 83

                  mean:   2.92162
              std. dev:   2.21642

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         2         4         
> 6

-------------------------------------------------------------------------
othersmiss_eye                         -->Did your illness cause other
                                       household members to lose time at
                                       work?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  86,455/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         1,569         0  No
                            59         1  Yes
                        86,455         .  

-------------------------------------------------------------------------
othersmissdays_eye                                     -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,10]                       units:  1
         unique values:  7                        missing .:  88,024/88,0
> 83

            tabulation:  Freq.  Value
                             4  0
                            31  1
                            12  2
                             6  3
                             3  4
                             1  5
                             2  10
                        88,024  .

-------------------------------------------------------------------------
phonedoc_eye                           -->Did you consult a healthcare
                                       provider over the phone about this
                                       illness?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  86,430/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         1,493         0  No
                           160         1  Yes
                        86,430         .  

-------------------------------------------------------------------------
visitdoc_eye                    -->Did you visit a health care provider? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  85,982/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         1,751         0  No
                           350         1  Yes
                        85,982         .  

-------------------------------------------------------------------------
visitdoctimes_eye                                     -->How many times? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,10]                       units:  1
         unique values:  7                        missing .:  87,797/88,0
> 83

            tabulation:  Freq.  Value
                             2  0
                           234  1
                            36  2
                             9  3
                             2  4
                             1  6
                             2  10
                        87,797  .

-------------------------------------------------------------------------
diagnosis_eye                          -->What illness did the health
                                       care provider say you had?
-------------------------------------------------------------------------

                  type:  string (str47)

         unique values:  162                      missing "":  39,536/88,
> 083

              examples:  ""
                         ""
                         "."
                         ".                               "

               warning:  variable has embedded and trailing blanks

-------------------------------------------------------------------------
emergencyroom_eye                    -->Did you visit an emergency room? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  86,474/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         1,580         0  No
                            29         1  Yes
                        86,474         .  

-------------------------------------------------------------------------
visitertimes_eye                                      -->How many times? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,2]                        units:  1
         unique values:  2                        missing .:  88,054/88,0
> 83

            tabulation:  Freq.  Value
                            25  1
                             4  2
                        88,054  .

-------------------------------------------------------------------------
hospitalized_eye                   -->Were you admitted to the hospital? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,0]                        units:  1
         unique values:  1                        missing .:  88,081/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                             2         0  No
                        88,081         .  

-------------------------------------------------------------------------
hospitaldays_eye                 -->How many days were you hospitalized? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,4]                        units:  1
         unique values:  4                        missing .:  88,077/88,0
> 83

            tabulation:  Freq.  Value
                             3  1
                             1  2
                             1  3
                             1  4
                        88,077  .

-------------------------------------------------------------------------
anyprescrdrug_eye                      -->Did you receive a prescription
                                       for an antibiotic or other drug
                                       for this illne
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  86,438/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         1,333         0  No
                           312         1  Yes
                        86,438         .  

-------------------------------------------------------------------------
ownmoneyfordrugs_eye                   -->About how much of your own or
                                       your household's money was spent
                                       altogether for
-------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [0,999999]                   units:  1
         unique values:  51                       missing .:  87,610/88,0
> 83

                  mean:    355200
              std. dev:    479059

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         4        30    999999    99999
> 9

-------------------------------------------------------------------------
anyotcmeds_eye                         -->Did you use any
                                       over-the-counter medications,
                                       including things like special d
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  85,837/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         1,185         0  No
                         1,061         1  Yes
                        85,837         .  

-------------------------------------------------------------------------
ownmoneyforotc_eye                     -->About how much of your own or
                                       your household's money was spent
                                       altogether for
-------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [0,999999]                   units:  1
         unique values:  47                       missing .:  87,040/88,0
> 83

                  mean:    164927
              std. dev:    371268

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         6        18    99999
> 9

-------------------------------------------------------------------------
stayhome_res    -->During your illness, did you miss any time from work? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  84,696/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         2,864         0  No
                           523         1  Yes
                        84,696         .  

-------------------------------------------------------------------------
stayhomedays_res                                       -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,13]                       units:  1
         unique values:  9                        missing .:  87,561/88,0
> 83

            tabulation:  Freq.  Value
                            32  0
                           282  1
                           113  2
                            54  3
                            19  4
                            17  5
                             1  6
                             3  7
                             1  13
                        87,561  .

-------------------------------------------------------------------------
stopdaily_res                          -->Did this illness prevent you
                                       from performing daily activities
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  79,224/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         6,854         0  No
                         2,005         1  Yes
                        79,224         .  

-------------------------------------------------------------------------
stopdailydays_res                                      -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,15]                       units:  1
         unique values:  16                       missing .:  85,925/88,0
> 83

                  mean:   2.63716
              std. dev:   1.95153

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         2         3         
> 5

-------------------------------------------------------------------------
othersmiss_res                         -->Did your illness cause other
                                       household members to lose time at
                                       work?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  80,609/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         7,190         0  No
                           284         1  Yes
                        80,609         .  

-------------------------------------------------------------------------
othersmissdays_res                                     -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,10]                       units:  1
         unique values:  8                        missing .:  87,799/88,0
> 83

            tabulation:  Freq.  Value
                            13  0
                           152  1
                            63  2
                            33  3
                            12  4
                             4  5
                             5  7
                             2  10
                        87,799  .

-------------------------------------------------------------------------
phonedoc_res                           -->Did you consult a healthcare
                                       provider over the phone about this
                                       illness?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  80,537/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         6,943         0  No
                           603         1  Yes
                        80,537         .  

-------------------------------------------------------------------------
visitdoc_res                    -->Did you visit a health care provider? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  79,496/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         7,235         0  No
                         1,352         1  Yes
                        79,496         .  

-------------------------------------------------------------------------
visitdoctimes_res                                     -->How many times? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,10]                       units:  1
         unique values:  7                        missing .:  86,857/88,0
> 83

            tabulation:  Freq.  Value
                             5  0
                         1,083  1
                           114  2
                            18  3
                             4  4
                             1  5
                             1  10
                        86,857  .

-------------------------------------------------------------------------
diagnosis_res                          -->What illness did the health
                                       care provider say you had?
-------------------------------------------------------------------------

                  type:  string (str50)

         unique values:  511                      missing "":  39,494/88,
> 083

              examples:  ""
                         ""
                         "."
                         ".                                             "

               warning:  variable has embedded and trailing blanks

-------------------------------------------------------------------------
emergencyroom_res                    -->Did you visit an emergency room? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  80,677/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         7,219         0  No
                           187         1  Yes
                        80,677         .  

-------------------------------------------------------------------------
visitertimes_res                                      -->How many times? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,3]                        units:  1
         unique values:  3                        missing .:  87,896/88,0
> 83

            tabulation:  Freq.  Value
                           170  1
                            16  2
                             1  3
                        87,896  .

-------------------------------------------------------------------------
hospitalized_res                   -->Were you admitted to the hospital? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  88,070/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                            12         0  No
                             1         1  Yes
                        88,070         .  

-------------------------------------------------------------------------
hospitaldays_res                 -->How many days were you hospitalized? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,5]                        units:  1
         unique values:  5                        missing .:  88,069/88,0
> 83

            tabulation:  Freq.  Value
                             8  1
                             3  2
                             1  3
                             1  4
                             1  5
                        88,069  .

-------------------------------------------------------------------------
anyprescrdrug_res                      -->Did you receive a prescription
                                       for an antibiotic or other drug
                                       for this illne
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  80,545/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         6,246         0  No
                         1,292         1  Yes
                        80,545         .  

-------------------------------------------------------------------------
ownmoneyfordrugs_res                   -->About how much of your own or
                                       your household's money was spent
                                       altogether for
-------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [0,999999]                   units:  1
         unique values:  87                       missing .:  86,630/88,0
> 83

                  mean:    150769
              std. dev:    357882

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         3        16        50    99999
> 9

-------------------------------------------------------------------------
anyotcmeds_res                         -->Did you use any
                                       over-the-counter medications,
                                       including things like special d
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  78,567/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         4,019         0  No
                         5,497         1  Yes
                        78,567         .  

-------------------------------------------------------------------------
ownmoneyforotc_res                     -->About how much of your own or
                                       your household's money was spent
                                       altogether for
-------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [0,999999]                   units:  1
         unique values:  70                       missing .:  82,929/88,0
> 83

                  mean:   42314.7
              std. dev:    201282

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         5        10        2
> 2

-------------------------------------------------------------------------
stayhome_ear    -->During your illness, did you miss any time from work? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  87,598/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                           383         0  No
                           102         1  Yes
                        87,598         .  

-------------------------------------------------------------------------
stayhomedays_ear                                       -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,7]                        units:  1
         unique values:  7                        missing .:  87,981/88,0
> 83

            tabulation:  Freq.  Value
                             7  0
                            47  1
                            24  2
                            10  3
                             4  4
                             7  5
                             3  7
                        87,981  .

-------------------------------------------------------------------------
stopdaily_ear                          -->Did this illness prevent you
                                       from performing daily activities
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  86,710/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         1,002         0  No
                           371         1  Yes
                        86,710         .  

-------------------------------------------------------------------------
stopdailydays_ear                                      -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,15]                       units:  1
         unique values:  13                       missing .:  87,675/88,0
> 83

                  mean:   2.87255
              std. dev:   2.00452

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         2         2         4         
> 5

-------------------------------------------------------------------------
othersmiss_ear                         -->Did your illness cause other
                                       household members to lose time at
                                       work?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  87,019/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         1,010         0  No
                            54         1  Yes
                        87,019         .  

-------------------------------------------------------------------------
othersmissdays_ear                                     -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,10]                       units:  1
         unique values:  8                        missing .:  88,029/88,0
> 83

            tabulation:  Freq.  Value
                             6  0
                            34  1
                             7  2
                             2  3
                             2  4
                             1  5
                             1  7
                             1  10
                        88,029  .

-------------------------------------------------------------------------
phonedoc_ear                           -->Did you consult a healthcare
                                       provider over the phone about this
                                       illness?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  86,988/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                           896         0  No
                           199         1  Yes
                        86,988         .  

-------------------------------------------------------------------------
visitdoc_ear                    -->Did you visit a health care provider? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  86,724/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                           899         0  No
                           460         1  Yes
                        86,724         .  

-------------------------------------------------------------------------
visitdoctimes_ear                                     -->How many times? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,10]                       units:  1
         unique values:  6                        missing .:  87,686/88,0
> 83

            tabulation:  Freq.  Value
                             3  0
                           344  1
                            40  2
                             5  3
                             4  4
                             1  10
                        87,686  .

-------------------------------------------------------------------------
diagnosis_ear                          -->What illness did the health
                                       care provider say you had?
-------------------------------------------------------------------------

                  type:  string (str50)

         unique values:  170                      missing "":  39,523/88,
> 083

              examples:  ""
                         ""
                         "."
                         ".                                              
>  "

               warning:  variable has embedded and trailing blanks

-------------------------------------------------------------------------
emergencyroom_ear                    -->Did you visit an emergency room? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  87,029/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         1,000         0  No
                            54         1  Yes
                        87,029         .  

-------------------------------------------------------------------------
visitertimes_ear                                      -->How many times? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,2]                        units:  1
         unique values:  2                        missing .:  88,029/88,0
> 83

            tabulation:  Freq.  Value
                            48  1
                             6  2
                        88,029  .

-------------------------------------------------------------------------
hospitalized_ear                   -->Were you admitted to the hospital? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,0]                        units:  1
         unique values:  1                        missing .:  88,081/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                             2         0  No
                        88,081         .  

-------------------------------------------------------------------------
hospitaldays_ear                 -->How many days were you hospitalized? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,3]                        units:  1
         unique values:  3                        missing .:  88,078/88,0
> 83

            tabulation:  Freq.  Value
                             2  1
                             1  2
                             2  3
                        88,078  .

-------------------------------------------------------------------------
anyprescrdrug_ear                      -->Did you receive a prescription
                                       for an antibiotic or other drug
                                       for this illne
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  86,955/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                           726         0  No
                           402         1  Yes
                        86,955         .  

-------------------------------------------------------------------------
ownmoneyfordrugs_ear                   -->About how much of your own or
                                       your household's money was spent
                                       altogether for
-------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [0,999999]                   units:  1
         unique values:  61                       missing .:  87,519/88,0
> 83

                  mean:    312083
              std. dev:    463726

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         5        20    999999    99999
> 9

-------------------------------------------------------------------------
anyotcmeds_ear                         -->Did you use any
                                       over-the-counter medications,
                                       including things like special d
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  86,645/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                           778         0  No
                           660         1  Yes
                        86,645         .  

-------------------------------------------------------------------------
ownmoneyforotc_ear                     -->About how much of your own or
                                       your household's money was spent
                                       altogether for
-------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [0,999999]                   units:  1
         unique values:  38                       missing .:  87,378/88,0
> 83

                  mean:    241144
              std. dev:    428070

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         2         8        50    99999
> 9

-------------------------------------------------------------------------
stayhome_uti    -->During your illness, did you miss any time from work? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  87,876/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                            74         0  No
                           133         1  Yes
                        87,876         .  

-------------------------------------------------------------------------
stayhomedays_uti                                       -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,7]                        units:  1
         unique values:  7                        missing .:  88,033/88,0
> 83

            tabulation:  Freq.  Value
                             9  0
                            30  1
                             4  2
                             3  3
                             2  5
                             1  6
                             1  7
                        88,033  .

-------------------------------------------------------------------------
stopdaily_uti                          -->Did this illness prevent you
                                       from performing daily activities
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  87,588/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                           375         0  No
                           120         1  Yes
                        87,588         .  

-------------------------------------------------------------------------
stopdailydays_uti                                      -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,15]                       units:  1
         unique values:  10                       missing .:  87,950/88,0
> 83

                  mean:   2.75188
              std. dev:   2.31728

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         2         3         
> 5

-------------------------------------------------------------------------
othersmiss_uti                         -->Did your illness cause other
                                       household members to lose time at
                                       work?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  87,620/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                           442         0  No
                            21         1  Yes
                        87,620         .  

-------------------------------------------------------------------------
othersmissdays_uti                                     -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,10]                       units:  1
         unique values:  7                        missing .:  88,062/88,0
> 83

            tabulation:  Freq.  Value
                             1  0
                            12  1
                             2  2
                             1  3
                             3  4
                             1  6
                             1  10
                        88,062  .

-------------------------------------------------------------------------
phonedoc_uti                           -->Did you consult a healthcare
                                       provider over the phone about this
                                       illness?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  87,588/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                           367         0  No
                           128         1  Yes
                        87,588         .  

-------------------------------------------------------------------------
visitdoc_uti                    -->Did you visit a health care provider? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  87,567/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                           308         0  No
                           208         1  Yes
                        87,567         .  

-------------------------------------------------------------------------
visitdoctimes_uti                                     -->How many times? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,10]                       units:  1
         unique values:  5                        missing .:  87,875/88,0
> 83

            tabulation:  Freq.  Value
                             1  0
                           175  1
                            27  2
                             4  3
                             1  10
                        87,875  .

-------------------------------------------------------------------------
diagnosis_uti                          -->What illness did the health
                                       care provider say you had?
-------------------------------------------------------------------------

                  type:  string (str50)

         unique values:  102                      missing "":  39,541/88,
> 083

              examples:  ""
                         ""
                         "."
                         ".                           "

               warning:  variable has embedded and trailing blanks

-------------------------------------------------------------------------
emergencyroom_uti                    -->Did you visit an emergency room? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  87,615/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                           429         0  No
                            39         1  Yes
                        87,615         .  

-------------------------------------------------------------------------
visitertimes_uti                                      -->How many times? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,2]                        units:  1
         unique values:  2                        missing .:  88,044/88,0
> 83

            tabulation:  Freq.  Value
                            37  1
                             2  2
                        88,044  .

-------------------------------------------------------------------------
hospitalized_uti                   -->Were you admitted to the hospital? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  88,078/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                             3         0  No
                             2         1  Yes
                        88,078         .  

-------------------------------------------------------------------------
hospitaldays_uti                 -->How many days were you hospitalized? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,1]                        units:  1
         unique values:  1                        missing .:  88,081/88,0
> 83

            tabulation:  Freq.  Value
                             2  1
                        88,081  .

-------------------------------------------------------------------------
anyprescrdrug_uti                      -->Did you receive a prescription
                                       for an antibiotic or other drug
                                       for this illne
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  87,566/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                           268         0  No
                           249         1  Yes
                        87,566         .  

-------------------------------------------------------------------------
ownmoneyfordrugs_uti                   -->About how much of your own or
                                       your household's money was spent
                                       altogether for
-------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [0,999999]                   units:  1
         unique values:  46                       missing .:  87,674/88,0
> 83

                  mean:    432788
              std. dev:    496043

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         7        40    999999    99999
> 9

-------------------------------------------------------------------------
anyotcmeds_uti                         -->Did you use any
                                       over-the-counter medications,
                                       including things like special d
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  87,575/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                           309         0  No
                           199         1  Yes
                        87,575         .  

-------------------------------------------------------------------------
ownmoneyforotc_uti                     -->About how much of your own or
                                       your household's money was spent
                                       altogether for
-------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [0,999999]                   units:  1
         unique values:  33                       missing .:  87,720/88,0
> 83

                  mean:    457330
              std. dev:    498833

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         6        25    999999    99999
> 9

-------------------------------------------------------------------------
stayhome_skn    -->During your illness, did you miss any time from work? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  84,690/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         3,306         0  No
                            87         1  Yes
                        84,690         .  

-------------------------------------------------------------------------
stayhomedays_skn                                       -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,9]                        units:  1
         unique values:  9                        missing .:  87,996/88,0
> 83

            tabulation:  Freq.  Value
                             7  0
                            48  1
                            14  2
                             9  3
                             2  4
                             4  5
                             1  6
                             1  8
                             1  9
                        87,996  .

-------------------------------------------------------------------------
stopdaily_skn                          -->Did this illness prevent you
                                       from performing daily activities
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  78,085/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         9,377         0  No
                           621         1  Yes
                        78,085         .  

-------------------------------------------------------------------------
stopdailydays_skn                                      -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,15]                       units:  1
         unique values:  14                       missing .:  87,446/88,0
> 83

                  mean:    2.8697
              std. dev:   2.29923

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         2         3         
> 6

-------------------------------------------------------------------------
othersmiss_skn                         -->Did your illness cause other
                                       household members to lose time at
                                       work?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  78,494/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         9,532         0  No
                            57         1  Yes
                        78,494         .  

-------------------------------------------------------------------------
othersmissdays_skn                                     -->How many days? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,10]                       units:  1
         unique values:  7                        missing .:  88,026/88,0
> 83

            tabulation:  Freq.  Value
                             5  0
                            35  1
                            11  2
                             2  3
                             1  4
                             2  5
                             1  10
                        88,026  .

-------------------------------------------------------------------------
phonedoc_skn                           -->Did you consult a healthcare
                                       provider over the phone about this
                                       illness?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  78,432/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         9,388         0  No
                           263         1  Yes
                        78,432         .  

-------------------------------------------------------------------------
visitdoc_skn                    -->Did you visit a health care provider? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  78,149/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         9,553         0  No
                           381         1  Yes
                        78,149         .  

-------------------------------------------------------------------------
visitdoctimes_skn                                     -->How many times? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,10]                       units:  1
         unique values:  8                        missing .:  87,744/88,0
> 83

            tabulation:  Freq.  Value
                             2  0
                           288  1
                            36  2
                             5  3
                             3  4
                             3  5
                             1  7
                             1  10
                        87,744  .

-------------------------------------------------------------------------
diagnosis_skn                          -->What illness did the health
                                       care provider say you had?
-------------------------------------------------------------------------

                  type:  string (str50)

         unique values:  210                      missing "":  39,538/88,
> 083

              examples:  ""
                         ""
                         "."
                         ".                                    "

               warning:  variable has embedded and trailing blanks

-------------------------------------------------------------------------
emergencyroom_skn                    -->Did you visit an emergency room? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  78,502/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         9,539         0  No
                            42         1  Yes
                        78,502         .  

-------------------------------------------------------------------------
visitertimes_skn                                      -->How many times? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,3]                        units:  1
         unique values:  3                        missing .:  88,041/88,0
> 83

            tabulation:  Freq.  Value
                            35  1
                             6  2
                             1  3
                        88,041  .

-------------------------------------------------------------------------
hospitalized_skn                   -->Were you admitted to the hospital? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,0]                        units:  1
         unique values:  1                        missing .:  88,078/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                             5         0  No
                        88,078         .  

-------------------------------------------------------------------------
hospitaldays_skn                 -->How many days were you hospitalized? 
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,1]                        units:  1
         unique values:  1                        missing .:  88,082/88,0
> 83

            tabulation:  Freq.  Value
                             1  1
                        88,082  .

-------------------------------------------------------------------------
anyprescrdrug_skn                      -->Did you receive a prescription
                                       for an antibiotic or other drug
                                       for this illne
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  78,464/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         9,298         0  No
                           321         1  Yes
                        78,464         .  

-------------------------------------------------------------------------
ownmoneyfordrugs_skn                   -->About how much of your own or
                                       your household's money was spent
                                       altogether for
-------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [0,999999]                   units:  1
         unique values:  58                       missing .:  87,595/88,0
> 83

                  mean:    360687
              std. dev:    480659

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         5      27.5    999999    99999
> 9

-------------------------------------------------------------------------
anyotcmeds_skn                         -->Did you use any
                                       over-the-counter medications,
                                       including things like special d
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  77,842/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         6,098         0  No
                         4,143         1  Yes
                        77,842         .  

-------------------------------------------------------------------------
ownmoneyforotc_skn                     -->About how much of your own or
                                       your household's money was spent
                                       altogether for
-------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [0,999999]                   units:  1
         unique values:  56                       missing .:  83,871/88,0
> 83

                  mean:   48441.6
              std. dev:    214703

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         4         8        1
> 5

-------------------------------------------------------------------------
stomachstdt                                        Start date for stomach
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15810,18170]                units:  1
       or equivalently:  [15apr2003,30sep2009]        units:  days
         unique values:  590                      missing .:  84,738/88,0
> 83

                  mean:   16828.7 = 27jan2006 (+ 17 hours)
              std. dev:   795.433

           percentiles:        10%       25%       50%       75%       90
> %
                             15914     16253     16323     17692     1779
> 0
                         28jul2003 01jul2004 09sep2004 09jun2008 15sep200
> 8

-------------------------------------------------------------------------
diarrheastdt                                      Start date for diarrhea
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15849,18170]                units:  1
       or equivalently:  [24may2003,30sep2009]        units:  days
         unique values:  600                      missing .:  84,231/88,0
> 83

                  mean:   17159.1 = 24dec2006 (+ 3 hours)
              std. dev:   891.322

           percentiles:        10%       25%       50%       75%       90
> %
                             15921     16266     17398     18068     1810
> 7
                         04aug2003 14jul2004 20aug2007 20jun2009 29jul200
> 9

-------------------------------------------------------------------------
nauseastdt                                          Start date for nausea
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15810,18168]                units:  1
       or equivalently:  [15apr2003,28sep2009]        units:  days
         unique values:  564                      missing .:  85,696/88,0
> 83

                  mean:   17176.7 = 10jan2007 (+ 18 hours)
              std. dev:   883.189

           percentiles:        10%       25%       50%       75%       90
> %
                             15926     16275     17396     18073     1810
> 7
                         09aug2003 23jul2004 18aug2007 25jun2009 29jul200
> 9

-------------------------------------------------------------------------
vomitingstdt                                      Start date for vomiting
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15850,18167]                units:  1
       or equivalently:  [25may2003,27sep2009]        units:  days
         unique values:  476                      missing .:  86,825/88,0
> 83

                  mean:   17199.5 = 02feb2007 (+ 13 hours)
              std. dev:   880.747

           percentiles:        10%       25%       50%       75%       90
> %
                             15914     16275     17407     18070     1810
> 6
                         28jul2003 23jul2004 29aug2007 22jun2009 28jul200
> 9

-------------------------------------------------------------------------
urinarytractinfectionstdt            Start date for urinarytractinfection
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15864,18167]                units:  1
       or equivalently:  [08jun2003,27sep2009]        units:  days
         unique values:  303                      missing .:  87,494/88,0
> 83

                  mean:     17504 = 04dec2007 (+ 0 hours)
              std. dev:   777.994

           percentiles:        10%       25%       50%       75%       90
> %
                             16264     17310     18042     18089     1811
> 2
                         12jul2004 24may2007 25may2009 11jul2009 03aug200
> 9

-------------------------------------------------------------------------
feverstdt                                            Start date for fever
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15845,18170]                units:  1
       or equivalently:  [20may2003,30sep2009]        units:  days
         unique values:  539                      missing .:  86,015/88,0
> 83

                  mean:   17238.9 = 13mar2007 (+ 23 hours)
              std. dev:   905.373

           percentiles:        10%       25%       50%       75%       90
> %
                             15918     16270     17705     18077     1810
> 6
                         01aug2003 18jul2004 22jun2008 29jun2009 28jul200
> 9

-------------------------------------------------------------------------
headachestdt                                      Start date for headache
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15862,18170]                units:  1
       or equivalently:  [06jun2003,30sep2009]        units:  days
         unique values:  611                      missing .:  83,342/88,0
> 83

                  mean:   17366.1 = 19jul2007 (+ 3 hours)
              std. dev:   837.476

           percentiles:        10%       25%       50%       75%       90
> %
                             16254     16304     17746     18083     1811
> 0
                         02jul2004 21aug2004 02aug2008 05jul2009 01aug200
> 9

-------------------------------------------------------------------------
sorethroatstdt                                  Start date for sorethroat
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15826,18170]                units:  1
       or equivalently:  [01may2003,30sep2009]        units:  days
         unique values:  610                      missing .:  83,490/88,0
> 83

                  mean:   17252.8 = 27mar2007 (+ 19 hours)
              std. dev:   896.518

           percentiles:        10%       25%       50%       75%       90
> %
                             15928     16282     17712     18078     1810
> 8
                         11aug2003 30jul2004 29jun2008 30jun2009 30jul200
> 9

-------------------------------------------------------------------------
coughstdt                                            Start date for cough
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15826,18168]                units:  1
       or equivalently:  [01may2003,28sep2009]        units:  days
         unique values:  556                      missing .:  85,454/88,0
> 83

                  mean:   17201.7 = 04feb2007 (+ 16 hours)
              std. dev:    933.68

           percentiles:        10%       25%       50%       75%       90
> %
                             15905     16260     17698     18077     1810
> 6
                         19jul2003 08jul2004 15jun2008 29jun2009 28jul200
> 9

-------------------------------------------------------------------------
coldstdt                                              Start date for cold
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15857,18169]                units:  1
       or equivalently:  [01jun2003,29sep2009]        units:  days
         unique values:  564                      missing .:  84,697/88,0
> 83

                  mean:   17378.7 = 31jul2007 (+ 16 hours)
              std. dev:   834.339

           percentiles:        10%       25%       50%       75%       90
> %
                             16255     16321   17761.5     18080     1811
> 3
                         03jul2004 07sep2004 17aug2008 02jul2009 04aug200
> 9

-------------------------------------------------------------------------
runnynosestdt                                    Start date for runnynose
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15826,18170]                units:  1
       or equivalently:  [01may2003,30sep2009]        units:  days
         unique values:  639                      missing .:  80,891/88,0
> 83

                  mean:   17224.2 = 27feb2007 (+ 5 hours)
              std. dev:   898.898

           percentiles:        10%       25%       50%       75%       90
> %
                             15934     16281     17691     18077     1811
> 1
                         17aug2003 29jul2004 08jun2008 29jun2009 02aug200
> 9

-------------------------------------------------------------------------
earachestdt                                        Start date for earache
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15715,18169]                units:  1
       or equivalently:  [10jan2003,29sep2009]        units:  days
         unique values:  465                      missing .:  86,647/88,0
> 83

                  mean:   17428.4 = 19sep2007 (+ 10 hours)
              std. dev:   810.457

           percentiles:        10%       25%       50%       75%       90
> %
                             16251   16323.5     17754     18085     1811
> 4
                         29jun2004 09sep2004 10aug2008 07jul2009 05aug200
> 9

-------------------------------------------------------------------------
wateryeyesstdt                                  Start date for wateryeyes
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15858,18164]                units:  1
       or equivalently:  [02jun2003,24sep2009]        units:  days
         unique values:  489                      missing .:  86,289/88,0
> 83

                  mean:   17352.7 = 05jul2007 (+ 17 hours)
              std. dev:    843.21

           percentiles:        10%       25%       50%       75%       90
> %
                             16248     16303     17741     18078     1810
> 7
                         26jun2004 20aug2004 28jul2008 30jun2009 29jul200
> 9

-------------------------------------------------------------------------
eyeinfectionstdt                              Start date for eyeinfection
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15828,18153]                units:  1
       or equivalently:  [03may2003,13sep2009]        units:  days
         unique values:  319                      missing .:  87,286/88,0
> 83

                  mean:   16642.3 = 25jul2005 (+ 8 hours)
              std. dev:   933.099

           percentiles:        10%       25%       50%       75%       90
> %
                             15884     15906     15948     17722     1808
> 2
                         28jun2003 20jul2003 31aug2003 09jul2008 04jul200
> 9

-------------------------------------------------------------------------
cutstdt                                                Start date for cut
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15857,18169]                units:  1
       or equivalently:  [01jun2003,29sep2009]        units:  days
         unique values:  239                      missing .:  87,736/88,0
> 83

                  mean:   17246.7 = 21mar2007 (+ 18 hours)
              std. dev:   838.761

           percentiles:        10%       25%       50%       75%       90
> %
                             15927     16280     17415     18068     1812
> 0
                         10aug2003 28jul2004 06sep2007 20jun2009 11aug200
> 9

-------------------------------------------------------------------------
rashstdt                                              Start date for rash
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [15851,18169]                units:  1
       or equivalently:  [26may2003,29sep2009]        units:  days
         unique values:  552                      missing .:  85,060/88,0
> 83

                  mean:   17355.7 = 08jul2007 (+ 16 hours)
              std. dev:    866.56

           percentiles:        10%       25%       50%       75%       90
> %
                             15930     16295     17745     18083     1811
> 0
                         13aug2003 12aug2004 01aug2008 05jul2009 01aug200
> 9

-------------------------------------------------------------------------
rawmeat_any                                          Any raw or red meat 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/88,083

            tabulation:  Freq.   Numeric  Label
                        75,879         0  No
                        12,204         1  Yes

-------------------------------------------------------------------------
fish_any                                                    Any raw fish 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/88,083

            tabulation:  Freq.   Numeric  Label
                        82,929         0  No
                         5,154         1  Yes

-------------------------------------------------------------------------
eggs_any                                                  Any runny eggs 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/88,083

            tabulation:  Freq.   Numeric  Label
                        82,793         0  No
                         5,290         1  Yes

-------------------------------------------------------------------------
anim_any                                              Any animal contact 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/88,083

            tabulation:  Freq.   Numeric  Label
                        44,216         0  No
                        43,867         1  Yes

-------------------------------------------------------------------------
gicontact_any                                Any contact with GI illness 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  33,833/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        49,696         0  No
                         4,554         1  Yes
                        33,833         .  

-------------------------------------------------------------------------
swimloc                                                     Swim location
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,5]                        units:  1
         unique values:  5                        missing .:  33,835/88,0
> 83

            tabulation:  Freq.  Value
                        10,533  1
                        24,531  2
                        18,275  3
                           848  4
                            61  5
                        33,835  .

-------------------------------------------------------------------------
meanbathers                                                   (unlabeled)
-------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,3.6666667]                units:  1.000e-07
         unique values:  11                       missing .:  60,948/88,0
> 83

                  mean:   2.04893
              std. dev:   .554756

           percentiles:        10%       25%       50%       75%       90
> %
                           1.33333   1.66667         2   2.33333   2.6666
> 7

-------------------------------------------------------------------------
prot                                   -->did [you/(he/she)] wear a hat
                                       or other protective clothing
                                       today?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  67,130/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        15,644         0  No
                         5,309         1  Yes
                        67,130         .  

-------------------------------------------------------------------------
venfest              Silver Beach festival day with 1000s of food vendors
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  67,068/88,0
> 83

            tabulation:  Freq.  Value
                        20,397  0
                           618  1
                        67,068  .

-------------------------------------------------------------------------
hhmem                                  -->HOW MANY MEMBERS IN YOUR
                                       HOUSEHOLD ARE AT THE BEACH TODAY
                                       INCLUDING YOURSELF?
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,12]                       units:  1
         unique values:  11                       missing .:  39,834/88,0
> 83

                  mean:   3.13544
              std. dev:   1.47911

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         2         3         4         
> 5

-------------------------------------------------------------------------
algaewash                              -->AFTER PLAYING WITH ALGAE, DID
                                       [YOU/(HE/SHE)] WASH
                                       [YOUR/(HIS/HER)] HANDS BEFO
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82,691/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         3,760         0  No
                         1,632         1  Yes
                        82,691         .  

-------------------------------------------------------------------------
sunburn1                               -->On which parts of the body were
                                       you sunburned (face or head)?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  61,368/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        24,940         0  No
                         1,775         1  Yes
                        61,368         .  

-------------------------------------------------------------------------
sunburn2                               -->On which parts of the body were
                                       you sunburned (neck or shoulders)?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  61,368/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        24,417         0  No
                         2,298         1  Yes
                        61,368         .  

-------------------------------------------------------------------------
sunburn3        -->On which parts of the body were you sunburned (back)? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  61,368/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        24,811         0  No
                         1,904         1  Yes
                        61,368         .  

-------------------------------------------------------------------------
sunburn4                               -->On which parts of the body were
                                       you sunburned (chest or abdomen)?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  61,368/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        25,526         0  No
                         1,189         1  Yes
                        61,368         .  

-------------------------------------------------------------------------
sunburn5                               -->On which parts of the body were
                                       you sunburned (arms or hands)?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  61,368/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        25,779         0  No
                           936         1  Yes
                        61,368         .  

-------------------------------------------------------------------------
sunburn6                               -->On which parts of the body were
                                       you sunburned (legs or feet)?
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  61,368/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        25,923         0  No
                           792         1  Yes
                        61,368         .  

-------------------------------------------------------------------------
sunburn7       -->On which parts of the body were you sunburned (other)? 
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  61,368/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        26,676         0  No
                            39         1  Yes
                        61,368         .  

-------------------------------------------------------------------------
sunburnother   -->Specify on which parts of the body were you sunburned. 
-------------------------------------------------------------------------

                  type:  string (str20)

         unique values:  30                       missing "":  61,198/88,
> 083

              examples:  ""
                         ""
                         ""
                         ".              "

               warning:  variable has embedded and trailing blanks

-------------------------------------------------------------------------
watertime                                            Time in water (mins)
-------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [0,900]                      units:  1
         unique values:  162                      missing .:  1,186/88,08
> 3

                  mean:   56.7649
              std. dev:   74.8504

           percentiles:        10%       25%       50%       75%       90
> %
                                 0         0        30        90       18
> 0

-------------------------------------------------------------------------
rawfood                                    Ate undercooked eggs/meat/fish
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/88,083

            tabulation:  Freq.  Value
                        70,768  0
                        17,315  1

-------------------------------------------------------------------------
race                                                      Racial category
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  race

                 range:  [1,9]                        units:  1
         unique values:  9                        missing .:  0/88,083

            tabulation:  Freq.   Numeric  Label
                        48,829         1  white
                         1,262         2  white, hispanic
                        26,014         3  non-white, hispanic
                         2,600         4  black
                         2,018         5  asian
                           240         6  american indian
                         1,753         7  multiple races
                         1,008         8  other
                         4,359         9  missing

-------------------------------------------------------------------------
wetsuit                                  Wear wet suit in water today (R)
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  73,998/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        12,625         0  No
                         1,460         1  Yes
                        73,998         .  

-------------------------------------------------------------------------
drinksy                                Drink any alcoholic beverages  (R)
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  54,721/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        29,775         0  No
                         3,587         1  Yes
                        54,721         .  

-------------------------------------------------------------------------
sunburnstill                                           Still have sunburn
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  yesno

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  84,291/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         3,103         0  No
                           689         1  Yes
                        84,291         .  

-------------------------------------------------------------------------
sunburndays                                    Duration of sunburn (days)
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  SunburnDaysX, but 16 nonmissing values are not l
> abeled

                 range:  [0,16]                       units:  1
         unique values:  17                       missing .:  84,991/88,0
> 83

              examples:  .     
                         .     
                         .     
                         .     

-------------------------------------------------------------------------
hhinc                                                    Household income
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  hhinclab

                 range:  [1,6]                        units:  1
         unique values:  6                        missing .:  69,413/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         1,440         1  <10,000 - 25,000
                         2,274         2  25,001 - 50,000
                         2,623         3  50,001 - 75,000
                         3,092         4  75,001 - 100,000
                         4,562         5  100,001 - 150,000
                         4,679         6  >150,000
                        69,413         .  

-------------------------------------------------------------------------
sunburnstdt                                            sunburn start date
-------------------------------------------------------------------------

                  type:  numeric daily date (int)

                 range:  [17313,18167]                units:  1
       or equivalently:  [27may2007,27sep2009]        units:  days
         unique values:  280                      missing .:  84,309/88,0
> 83

                  mean:   17741.2 = 28jul2008 (+ 5 hours)
              std. dev:   244.786

           percentiles:        10%       25%       50%       75%       90
> %
                             17349     17690     17719     17789     1808
> 2
                         02jul2007 07jun2008 06jul2008 14sep2008 04jul200
> 9

-------------------------------------------------------------------------
totdays                                                   Total swim days
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,16]                       units:  1
         unique values:  16                       missing .:  66,719/88,0
> 83

                  mean:   2.56661
              std. dev:   2.58959

           percentiles:        10%       25%       50%       75%       90
> %
                                 1         1         2         3         
> 6

-------------------------------------------------------------------------
berm                                        Berm status (1=open,0=closed)
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  lberm

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  72,884/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                        11,180         0  Closed
                         4,019         1  Open
                        72,884         .  

-------------------------------------------------------------------------
stmatch                                   Site/Time Specific Avg Match ID
-------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [1,7]                        units:  1
         unique values:  7                        missing .:  74,063/88,0
> 83

            tabulation:  Freq.  Value
                           134  1
                         6,639  2
                         2,258  3
                           799  4
                            16  5
                         3,697  6
                           477  7
                        74,063  .

-------------------------------------------------------------------------
groundwater                                        Groundwater flow level
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  lgroundwat

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  81,918/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         3,145         0  Below median flow
                         3,020         1  Above median flow
                        81,918         .  

-------------------------------------------------------------------------
sunhr_cat                       Total hours in direct sunlight (category)
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  saq9b

                 range:  [1,5]                        units:  1
         unique values:  5                        missing .:  76,239/88,0
> 83

            tabulation:  Freq.   Numeric  Label
                         1,611         1  Less than one hour
                         3,491         2  1-2 hours
                         4,630         3  3-4 hours
                         1,280         4  5-6 hours
                           832         5  More than 6 hours
                        76,239         .  

-------------------------------------------------------------------------
hhinc_mb          Household Pre-tax income, 2002 (Mission Bay categories)
-------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  isum

                 range:  [1,19]                       units:  1
         unique values:  19                       missing .:  79,947/88,0
> 83

              examples:  .     
                         .     
                         .     
                         .     

. log close
      name:  <unnamed>
       log:  /Users/benarnold/dropbox/13beaches/data/final/13beaches-epi-
> codebook.txt
  log type:  text
 closed on:   7 Jan 2016, 15:43:19
-------------------------------------------------------------------------

. 
. 
. *---------------------------------------------
. * variable reconciliation
. *---------------------------------------------
. 
. log using "~/dropbox/13beaches/src/dm/4-append-epi-data.log", text appe
> nd
-------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/benarnold/dropbox/13beaches/src/dm/4-append-epi-data.
> log
  log type:  text
 opened on:   7 Jan 2016, 15:43:19

. 
. 
. use "~/dropbox/13beaches/data/temp/neear-epi-vars.dta", clear
(variables for neear-epi.dta)

. sort name

. tempfile neear

. save `neear'
file /var/folders/bp/zslz_kn157v3zs98sv57pflc0000gn/T//S_05270.000001 sav
> ed

. 
. use "~/dropbox/13beaches/data/temp/adm-epi-vars.dta", clear
(variables for adm-epi.dta)

. sort name

. merge 1:1 name using `neear'
(note: variable type was str5, now str6 to accommodate using data's
       values)
(note: variable format was str6, now str8 to accommodate using data's
       values)
(note: variable varlab was str57, now str80 to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                            44
        from master                        11  (_merge==1)
        from using                         33  (_merge==2)

    matched                               248  (_merge==3)
    -----------------------------------------

. 
. gen byte inNEEAR = inlist(_merge,2,3)

.         label var inNEEAR "In NEEAR data"

. gen byte inADM = inlist(_merge,1,3)

.         label var inADM "In ADM data"

.         drop _merge

. 
. save `neear', replace
file /var/folders/bp/zslz_kn157v3zs98sv57pflc0000gn/T//S_05270.000001 sav
> ed

. 
. use "~/dropbox/13beaches/data/temp/mb-epi-vars.dta", clear
(variables for mb-epi.dta)

. sort name

. merge 1:1 name using `neear'
(note: variable name was str17, now str26 to accommodate using data's
       values)
(note: variable type was str5, now str6 to accommodate using data's
       values)
(note: variable format was str6, now str8 to accommodate using data's
       values)
(note: variable vallab was str6, now str25 to accommodate using data's
       values)
(note: variable varlab was str61, now str80 to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                           182
        from master                         2  (_merge==1)
        from using                        180  (_merge==2)

    matched                               112  (_merge==3)
    -----------------------------------------

. gen byte inMB = inlist(_merge,1,3)

.         label var inMB "In Mission Bay data"

.         drop _merge

. 
. * set unmatched values to 0
. replace inNEEAR = 0 if inNEEAR==.
(2 real changes made)

. replace inADM = 0 if inADM==.
(2 real changes made)

. 
. 
. * tabulate discordance
. tab inNEEAR inADM

  In NEEAR |      In ADM data
      data |         0          1 |     Total
-----------+----------------------+----------
         0 |         2         11 |        13 
         1 |        33        248 |       281 
-----------+----------------------+----------
     Total |        35        259 |       294 


. tab inNEEAR inMB

  In NEEAR |  In Mission Bay data
      data |         0          1 |     Total
-----------+----------------------+----------
         0 |         9          4 |        13 
         1 |       171        110 |       281 
-----------+----------------------+----------
     Total |       180        114 |       294 


. tab inADM inMB

    In ADM |  In Mission Bay data
      data |         0          1 |     Total
-----------+----------------------+----------
         0 |        33          2 |        35 
         1 |       147        112 |       259 
-----------+----------------------+----------
     Total |       180        114 |       294 


. 
. * list discordance
. list name if inNEEAR & !inADM

     +---------------+
     |          name |
     |---------------|
124. |       areamst |
125. |     beachtype |
127. |     blockface |
139. | diagnosis_ear |
140. | diagnosis_eye |
     |---------------|
141. | diagnosis_gas |
142. | diagnosis_res |
143. | diagnosis_skn |
144. | diagnosis_uti |
164. | gicontact_any |
     |---------------|
165. | gicontact_int |
185. |           lat |
186. |         longi |
187. |   meanbathers |
188. |         miles |
     |---------------|
222. |          prot |
223. |      protbrim |
224. |       protslv |
225. |       raceoth |
228. |         reapp |
     |---------------|
235. |        seatdr |
239. |           spf |
250. |      sunburn1 |
251. |      sunburn2 |
252. |      sunburn3 |
     |---------------|
253. |      sunburn4 |
254. |      sunburn5 |
255. |      sunburn6 |
256. |      sunburn7 |
258. |  sunburnother |
     |---------------|
263. |       swimloc |
264. |       tanning |
271. |       venfest |
     +---------------+

. list name if inADM & !inNEEAR

     +--------------+
     |         name |
     |--------------|
 15. |    beachcode |
 28. |      drinksy |
126. |         berm |
166. |  groundwater |
171. |        hhinc |
     |--------------|
242. |      stmatch |
257. |  sunburndays |
259. |  sunburnstdt |
260. | sunburnstill |
265. |      totdays |
     |--------------|
294. |      wetsuit |
     +--------------+

. 
. list name if (inNEEAR & inADM) & (!inMB)

     +----------------------------+
     |                       name |
     |----------------------------|
115. |                 algaemouth |
116. |                  algaewash |
117. |             anyotcmeds_uti |
118. |          anyprescrdrug_ear |
119. |          anyprescrdrug_eye |
     |----------------------------|
120. |          anyprescrdrug_gas |
121. |          anyprescrdrug_res |
122. |          anyprescrdrug_skn |
123. |          anyprescrdrug_uti |
128. |                       cold |
     |----------------------------|
129. |                coldallergy |
130. |                   colddays |
131. |                   coldstdt |
132. |                  coldstill |
133. |                       come |
     |----------------------------|
134. |               coughallergy |
135. |                  coughdays |
136. |                 coughstill |
137. |                    cutdays |
138. |                   cutstill |
     |----------------------------|
145. |               diarrheadays |
146. |             diarrheanumber |
147. |              diarrheastill |
148. |             earacheallergy |
149. |                earachedays |
     |----------------------------|
150. |               earachestill |
151. |                    earbase |
152. |          emergencyroom_ear |
153. |          emergencyroom_eye |
154. |          emergencyroom_gas |
     |----------------------------|
155. |          emergencyroom_res |
156. |          emergencyroom_skn |
157. |          emergencyroom_uti |
158. |           eyeinfectiondays |
159. |          eyeinfectionstill |
     |----------------------------|
160. |                  feverdays |
161. |                 feverstill |
162. |                  fevertemp |
163. |             fevertemptaken |
167. |                   headache |
     |----------------------------|
168. |               headachedays |
169. |               headachestdt |
170. |              headachestill |
172. |                      hhmem |
173. |           hospitaldays_ear |
     |----------------------------|
174. |           hospitaldays_eye |
175. |           hospitaldays_gas |
176. |           hospitaldays_res |
177. |           hospitaldays_skn |
178. |           hospitaldays_uti |
     |----------------------------|
179. |           hospitalized_ear |
180. |           hospitalized_eye |
181. |           hospitalized_gas |
182. |           hospitalized_res |
183. |           hospitalized_skn |
     |----------------------------|
184. |           hospitalized_uti |
189. |                 nauseadays |
190. |                nauseastill |
191. |             othersmiss_ear |
192. |             othersmiss_eye |
     |----------------------------|
193. |             othersmiss_gas |
194. |             othersmiss_res |
195. |             othersmiss_skn |
196. |             othersmiss_uti |
197. |         othersmissdays_ear |
     |----------------------------|
198. |         othersmissdays_eye |
199. |         othersmissdays_gas |
200. |         othersmissdays_res |
201. |         othersmissdays_skn |
202. |         othersmissdays_uti |
     |----------------------------|
203. |       ownmoneyfordrugs_ear |
204. |       ownmoneyfordrugs_eye |
205. |       ownmoneyfordrugs_gas |
206. |       ownmoneyfordrugs_res |
207. |       ownmoneyfordrugs_skn |
     |----------------------------|
208. |       ownmoneyfordrugs_uti |
209. |         ownmoneyforotc_ear |
210. |         ownmoneyforotc_eye |
211. |         ownmoneyforotc_gas |
212. |         ownmoneyforotc_res |
     |----------------------------|
213. |         ownmoneyforotc_skn |
214. |         ownmoneyforotc_uti |
215. |               phonedoc_ear |
216. |               phonedoc_eye |
217. |               phonedoc_gas |
     |----------------------------|
218. |               phonedoc_res |
219. |               phonedoc_skn |
220. |               phonedoc_uti |
221. |                       pool |
226. |                   rashdays |
     |----------------------------|
227. |                  rashstill |
229. |           runnynoseallergy |
230. |              runnynosedays |
231. |             runnynosestill |
232. |                    sanddry |
     |----------------------------|
233. |                  sandmouth |
234. |                   sandwash |
236. |          sorethroatallergy |
237. |             sorethroatdays |
238. |            sorethroatstill |
     |----------------------------|
240. |               stayhome_uti |
241. |           stayhomedays_uti |
243. |                    stomach |
244. |                stomachdays |
245. |               stomachstill |
     |----------------------------|
246. |              stopdaily_uti |
247. |          stopdailydays_uti |
248. |                    sunbase |
249. |                    sunburn |
261. |                      sunhr |
     |----------------------------|
262. |                     sunmin |
266. |      urinarytractinfection |
267. |  urinarytractinfectiondays |
268. |  urinarytractinfectionstdt |
269. | urinarytractinfectionstill |
     |----------------------------|
270. |                    utibase |
272. |               visitdoc_uti |
273. |          visitdoctimes_ear |
274. |          visitdoctimes_eye |
275. |          visitdoctimes_gas |
     |----------------------------|
276. |          visitdoctimes_res |
277. |          visitdoctimes_skn |
278. |          visitdoctimes_uti |
279. |           visitertimes_ear |
280. |           visitertimes_eye |
     |----------------------------|
281. |           visitertimes_gas |
282. |           visitertimes_res |
283. |           visitertimes_skn |
284. |           visitertimes_uti |
285. |                  vomitbase |
     |----------------------------|
286. |               vomitingdays |
287. |             vomitingnumber |
288. |              vomitingstill |
289. |                 wateryeyes |
290. |          wateryeyesallergy |
     |----------------------------|
291. |             wateryeyesdays |
292. |             wateryeyesstdt |
293. |            wateryeyesstill |
     +----------------------------+

. list name if inMB & !(inNEEAR | inADM)

     +-----------+
     |      name |
     |-----------|
 50. |  hhinc_mb |
101. | sunhr_cat |
     +-----------+

. 
. 
. label data "13 beaches variable list, created by 4-append-epi-data.do"

. saveold "~/dropbox/13beaches/data/final/13beaches-epi-varlist.dta", rep
> lace version(12)
(saving in Stata 12 format, which can be read by Stata 11 or 12)
file ~/dropbox/13beaches/data/final/13beaches-epi-varlist.dta saved

. outsheet using "~/dropbox/13beaches/data/final/13beaches-epi-varlist.cs
> v", comma replace

. 
. 
. 
. 
. log close
      name:  <unnamed>
       log:  /Users/benarnold/dropbox/13beaches/src/dm/4-append-epi-data.
> log
  log type:  text
 closed on:   7 Jan 2016, 15:43:19
-------------------------------------------------------------------------

. exit

end of do-file
